{
    "version": "https://jsonfeed.org/version/1",
    "title": "Ad Hoc",
    "description": "",
    "home_page_url": "https://gadgetboy.org",
    "feed_url": "https://gadgetboy.org/feed.json",
    "user_comment": "",
    "author": {
        "name": "John A. Federico"
    },
    "items": [
        {
            "id": "https://gadgetboy.org/best-budget-sports-earbuds-review-earfun-free-mini-earbuds/",
            "url": "https://gadgetboy.org/best-budget-sports-earbuds-review-earfun-free-mini-earbuds/",
            "title": "Best Budget Sports EarBuds: Review of the EarFun Free Mini EarBuds",
            "summary": "I spent a good portion of my life “making do” with whatever&hellip;",
            "content_html": "<p>I spent a good portion of my life “making do” with whatever I could. When I needed a car during college, I bought a 1979 AMC Concord for $500. When I had to run with the Crew team, I wore whatever sneakers I had at the time - Nike wrestling shoes. (I guess you could call them the original barefoot running shoes.) 😉 When I started podcasting, I used an MP3 player that also happened to record audio.</p>\n<p>Now that I’m further along in life, I’ve changed my perspective a bit: I always make sure I have the right gear for the job. That doesn’t mean the best or the most expensive, it just means that I’m not wearing wrestling shoes to go running anymore and I record podcasts with a professional but still affordable microphone.</p>\n<p>Recently, I decided to train for a Spartan Race. It’s been on my bucket list and I’m not getting any younger, so why not?</p>\n<p>In addition to rucking and CrossFit, I started trail running and mountain biking again. I like to listen to audiobooks, podcasts and music when I workout so I’ve been wearing my beloved <a href=\"https://amzn.to/3LOebEk\">Sony WF-1000XM3 True Wireless Earbuds</a>. </p>\n<blockquote>\n<p>I bought them on Amazon (refurbished, of course.). As I write this, they’re still available renewed for their lowest price ever - around $83. That’s a steal, especially for the best earbuds I’ve ever owned, wired or wireless. If you decide to buy these, be sure to get the 2 or 3-year protection plan since Amazon Renewed electronics only come with a 90-day warranty.</p>\n</blockquote>\n<p>While the Sony’s are fine for rucking, they’re less than ideal for running, mountain biking or CrossFit. They don’t really stay in my ears during these activities and just as importantly - especially when training during the Summer in Austin, TX - they aren’t sweatproof.</p>\n<p>I needed an alternative.</p>\n<p>I’ve owned SO MANY pairs of earbuds and headphones over the years that I really didn’t want to spend a ton of money on new ones just for my workouts. </p>\n<p>It turns out, I didn’t have to.</p>\n<p>I did a quick <a href=\"https://neeva.com/p/signup?o=s&amp;c=22a0063a-c7e2-11eb-a1e8-12ca2bc0dad6\">Neeva</a> search for “best budget sports earbuds” and found lots of positive reviews for the <a href=\"https://amzn.to/3sbyGDv\">EarFun Free Mini True Wireless Earbuds</a>. </p>\n<p>Most people probably have never heard of the EarFun brand - I’ll admit, I really didn’t either - but don’t let that turn you off. </p>\n<p>With a 40% off coupon, I was able to pick up a pair for $17.39 on Amazon. That’s just about the cost of a few coffees at Starbucks, so I figured I’d give them a try.</p>\n<p>They’re small - much smaller than my Sony’s - and they boast 5 hours of play time (24 hours total play time with the charging case) and an IPX7 protection rating.</p>\n<blockquote>\n<p>Nerd Note: IP refers to the <em>Ingress Protection</em> Rating, summarized by the internationally recognized IP Code. According to the <a href=\"https://en.wikipedia.org/wiki/IP_Code\">Wikipedia entry on IP Codes</a>, the EarFun Free Mini’s are “dust tight” and that “ingress of water in harmful quantities shall not be possible when the enclosure is immersed in water under defined conditions of pressure and time.” End Nerd Note.</p>\n</blockquote>\n<p>The earbuds arrived last night. In the box are the buds with the medium size silicone tips already attached, a set of small and large eartips, a disposable tool to clear ear wax from the earbuds, a short USB-C cable and a manual. I plugged them in to charge using a USB-C cable which, in itself, is amazing for budget headphones. These days, USB-C ports and fast charging are typically found in more expensive, higher end devices. </p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/60/earfun-003img_1404.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/60/responsive/earfun-003img_1404-xs.jpg 300w ,https://gadgetboy.org/media/posts/60/responsive/earfun-003img_1404-sm.jpg 480w ,https://gadgetboy.org/media/posts/60/responsive/earfun-003img_1404-md.jpg 768w ,https://gadgetboy.org/media/posts/60/responsive/earfun-003img_1404-lg.jpg 1024w\"  alt=\"EarFun Free Mini EarBuds USB-C Port\" width=\"4032\" height=\"3024\" /></figure></p>\n<p>This morning, I popped them in during my morning constitutional to give them a proper listen. To say the least, I’m surprised. True wireless earbuds at this price - even before the coupon - have no right to sound or fit this good.</p>\n<p>There’s an acceptable bass response, which I didn’t expect. For reference, my wired Shure SE 215 earbuds (Clear style, <a href=\"https://amzn.to/3h2JH3z\">currently $107 on Amazon</a>) have almost no bass to speak of until you adjust the EQ. (Assuming your device has proper EQ controls.) Shure elected to keep a neutral sound signature as these are sometimes used as in-ear monitors for musicians and recording engineers. I typically use these during long voiceover recording sessions when my <a href=\"https://amzn.to/3h58Om7\">Sony MDR-7506’s</a> would start to give me a headache after a couple of hours.</p>\n<p>The mids and highs in the EarFun Free Mini’s are a bit lacking, but that’s just fine for my use case - I bought these for the form factor and the sweat resistance, not for studio work.</p>\n<p>As for the fit, the medium size silicone eartips fit me perfectly. The noise isolation is good enough that I can listen to Foo Fighters at a reasonable volume yet can’t hear my wife when she speaks to me. </p>\n<p>Of course, I didn’t buy these earbuds to sit around the house, so it was time to put them to the test and go for a run. </p>\n<p>It was a short trail run but long enough for me to evaluate whether or not these buds would stay in my ears. It’s a little cooler here in Austin right now, so I really couldn’t take excessive sweat into account, but they didn’t even jiggle once in my ear.</p>\n<p>The icing on the cake for these buds is that they have touch controls. Yes, bona fide capacitive touch controls for volume, play/pause and track skipping plus access to your favorite voice assistant.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/60/earfun_free_mini_touch_controls.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/60/responsive/earfun_free_mini_touch_controls-xs.jpg 300w ,https://gadgetboy.org/media/posts/60/responsive/earfun_free_mini_touch_controls-sm.jpg 480w ,https://gadgetboy.org/media/posts/60/responsive/earfun_free_mini_touch_controls-md.jpg 768w ,https://gadgetboy.org/media/posts/60/responsive/earfun_free_mini_touch_controls-lg.jpg 1024w\"  alt=\"EarFun Free Mini Touch Controls\" width=\"970\" height=\"600\" /></figure></p>\n<p>Finally, if you decide you want these to be your daily drivers, you can use each earbud independently. (My Sony’s can’t even do that!) Since each bud has its own microphone, this is great for phone calls. Note: I didn’t test these for phone calls since this feature is not really part of my use case.</p>\n<p>In my opinion, these buds have only one missing feature: proximity sensors to activate automatic pausing of music or spoken word when one or both buds are removed from your ears. At this price point, that’s a small trade-off especially since adding the sensors would have increased the cost.</p>\n<h3 id=\"pros\">Pros</h3>\n<ul>\n<li>Low cost</li>\n<li>Great Fit</li>\n<li>Solid bass response</li>\n<li>USB-C Fast Charging</li>\n<li>5 hours of use per charge</li>\n<li>24 hours of total use with the included charging case</li>\n<li>IPX7 water and dust ingress rating</li>\n<li>Touch controls</li>\n</ul>\n<h3 id=\"cons\">Cons</h3>\n<ul>\n<li>Flat mids and highs</li>\n<li>No proximity sensors for auto-pause</li>\n<li>No app for EQ controls</li>\n</ul>\n<h3 id=\"would-i-recommend-the-earfun-free-minis\">Would I recommend the EarFun Free Mini’s?</h3>\n<p>If your use case is similar to mine, I would absolutely recommend them. If you use the single earbud mode or for phone calls, let me know in the comments .</p>\n",
            "image": "https://gadgetboy.org/media/posts/60/earfun-002img_1401.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Review",
                   "Gadgets",
                   "Fitness Training"
            ],
            "date_published": "2022-02-22T08:28:51-06:00",
            "date_modified": "2022-02-25T18:54:55-06:00"
        },
        {
            "id": "https://gadgetboy.org/the-mount-fitzroy-rucking-challenge/",
            "url": "https://gadgetboy.org/the-mount-fitzroy-rucking-challenge/",
            "title": "The Mount Fitzroy Rucking Challenge - Final Update",
            "summary": "30 Days. 30 Hours of Listening. 90 Miles. Final results below. One&hellip;",
            "content_html": "<h2 id=\"30-days-30-hours-of-listening-90-miles\">30 Days. 30 Hours of Listening. 90 Miles.</h2>\n<p>Final results below.</p>\n<p>One of my favorite authors, <a href=\"https://scottsigler.com/\">Scott Sigler</a>, has released <em><a href=\"https://amzn.to/320EuBK\">Mount Fitzroy</a></em>, the sequel to his amazing book, <em><a href=\"https://amzn.to/39X2D0a\">Earthcore</a></em>.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/57/mountfitzroy.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/57/responsive/mountfitzroy-xs.jpg 300w ,https://gadgetboy.org/media/posts/57/responsive/mountfitzroy-sm.jpg 480w ,https://gadgetboy.org/media/posts/57/responsive/mountfitzroy-md.jpg 768w ,https://gadgetboy.org/media/posts/57/responsive/mountfitzroy-lg.jpg 1024w\"  alt=\"Mount Fitzroy Cover Art\" width=\"500\" height=\"500\" /></figure></p>\n<p>I’ve been waiting <strong>years</strong> for this book but it’s only available as an Audible Original audiobook - and it’s almost <strong>30 hours long</strong>.</p>\n<p>So, when you’re working remotely and no longer have a commute, how do you schedule your listening time?</p>\n<p><strong>Rucking!</strong></p>\n<h2 id=\"wtf-is-rucking\">WTF is Rucking?</h2>\n<p>The term <em>rucking</em> comes from the military and has been a training regiment since the Romans were conquering the world. Simply defined, it’s walking or hiking while carrying weight, typically on your back.</p>\n<p>I started rucking last Summer. I purchased a <a href=\"https://amzn.to/321VBDk\">weight vest</a> for my home CrossFit workouts. One day, when I didn’t have a workout planned and didn’t feel like recycling one, I decided to go for a hike in the green space near our community. </p>\n<p>I put on my vest, grabbed the trail map and headed out. The added weight really got my heart rate up, especially on the inclines. I’ve been hooked ever since.</p>\n<p>These days, I ruck with <a href=\"https://amzn.to/3dOU7BF\">40-60 pounds of sand bags</a> in a <a href=\"https://amzn.to/3uFJd7Z\">military-style rucksack</a>.</p>\n<p>For the Mount Fitzroy Challenge, I’ll probably stay on the streets in my neighborhood with an ocassional hike on the local trails.</p>\n<h2 id=\"want-to-join-me\">Want to join me?</h2>\n<p><a href=\"https://amzn.to/320EuBK\">Pick up your own copy of Mount Fitzroy</a>, then grab a backpack. If you’ve never rucked before, just put a few books and/or bottles of water in your sack and increase the weight when you feel comfortable doing so.</p>\n<p>Here’s where I am so far. I’ll update this after every ruck. Note that I won’t be doing this every day due to weather, work, travel, etc. but it’s my goal to complete this ASAP.</p>\n<p>If you want to share your progress, drop me a line <a href=\"https://gadgetboy.org/contact/\">here</a> or on <a href=\"https://twitter.com/gadgetboy\">twitter</a>. You can also connect with me on the Garmin app.</p>\n<h2 id=\"final-update\">Final Update</h2>\n<p>I didn’t quite hit my timeline of 30 days due to work and family responsibilities. Ditto for my mileage. (I “cheated” a little and listened to an hour or so on a short road trip.)</p>\n<p><strong>Total Miles Rucked: 85.15 miles</strong></p>\n<p>I’m definitely going to do this again…with shorter books. ;)</p>\n",
            "image": "https://gadgetboy.org/media/posts/57/lina-verovaya-TeBKnxH_9XA-unsplash.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Fitness",
                   "Books"
            ],
            "date_published": "2021-04-09T07:07:08-05:00",
            "date_modified": "2021-07-13T06:59:32-05:00"
        },
        {
            "id": "https://gadgetboy.org/the-leaders-guide-to-video-conferencing-part-1/",
            "url": "https://gadgetboy.org/the-leaders-guide-to-video-conferencing-part-1/",
            "title": "The Leader&#x27;s Guide to Video Conferencing, Part 1",
            "summary": "Welcome to You TV. The global pandemic has forced many of us&hellip;",
            "content_html": "<h2 id=\"welcome-to-you-tv\">Welcome to You TV.</h2>\n<p>The global pandemic has forced many of us into our homes to work remotely, where all of our meetings take place on the phone or in video conferences. You’re on camera and speaking into a microphone more than ever and, more often than not, you’re doing it wrong.</p>\n<p>When you went to the office or met with partners or customers, did you wear business clothes suitable for the context? Did you comb your hair? Shower? Shave?</p>\n<p>Of course you did. That’s what it takes to create your <strong>desired net impression</strong> among your co-workers, peers, management and customers.</p>\n<p>Why wouldn’t you be concerned about creating a desired net impression when working remotely?</p>\n<p>Firstly, that means proper clothing and grooming (even if it’s only above your waist). That should be a given.</p>\n<p>But if you want to do it right, you need to learn how to produce <strong>You TV</strong>.</p>\n<p>There’s a reason that talking heads on TV or interview subjects appear in a certain way. Directors and producers want an interesting background for each subject to create interest and to eliminate distractions that may draw the viewer’s eye away from the subject. They want consistency of video quality, especially between cameras. They want subjects that are properly and consistently lit and, most importantly, they want those subjects to be properly <strong>heard</strong>.</p>\n<p>Every time you get on a video conference, you’re on You TV.</p>\n<p>I don’t expect you to create a professional studio in your home with all the gear and planning that may require, but I do expect you to <strong>look</strong> like a leader and <strong>sound</strong> like a leader when you’re working with others using video communication.</p>\n<p>Here are some easy and inexpensive things you can do to up your game.</p>\n<h2 id=\"the-basics\">The Basics</h2>\n<ul>\n<li>Frame yourself</li>\n<li>Compose an orderly background</li>\n<li>Place your webcam at eye level</li>\n<li>Place your brightest light source in front of you</li>\n<li>Wear a headset with a good microphone</li>\n</ul>\n<p>Let’s break these down with some help from the tweets of <a href=\"https://twitter.com/ratemyskyperoom\">Room Rater</a>. 😉</p>\n<h2 id=\"frame-yourself\">Frame Yourself</h2>\n<p>How do you want to be viewed? Are you in a working meeting, where you need access to your computer keyboard, or are you just having a conversation?</p>\n<p>If you’re in a working meeting, you’ll probably need to be near a solid surface, so you can type or share your screen. In that case, frame yourself about an arm’s length from your camera.</p>\n<p>If you’re just having a conversation, you might want to sit in a comfortable chair or on a couch, perhaps displaying a bit more than your head and shoulders. </p>\n<p>In that case, you’ll have to experiment with the placement of your camera in your environment to see how you appear in your frame.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Love the blue. Want the chair. Pro San Pellegrino. 9/10 <a href=\"https://twitter.com/hashtag/RichinaBicette?src=hash&amp;ref_src=twsrc%5Etfw\">#RichinaBicette</a> <a href=\"https://t.co/EJFlzqxKbZ\">pic.twitter.com/EJFlzqxKbZ</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1336831718607695873?ref_src=twsrc%5Etfw\">December 10, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<h3 id=\"compose-an-orderly-background\">Compose an Orderly Background</h3>\n<p>Where in your home are you working?</p>\n<p>You may have never worked at home before. You may never have even considered it, so you didn’t plan for it. Perhaps you live in an apartment, maybe even with roommates. Or maybe you have a growing family and don’t have any spare rooms to use as a home office. You might not even have room for a desk.</p>\n<p>That’s OK, you can address almost all of the above, and more.</p>\n<p>When framing yourself, be sure to check behind you for clutter or choppy backgrounds. Don’t be afraid to move things around - your chair, other furniture, art, computers, printers - even people. (Asking your roommate or spouse to sit somewhere else is just fine.)</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At least you got the 10/10 <a href=\"https://t.co/5IQsGrlL56\">https://t.co/5IQsGrlL56</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1336453261616951297?ref_src=twsrc%5Etfw\">December 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<p>If your background is a blank wall, shine a light on it to create the appearance of depth.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/56/blank_wall_lighting.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/56/responsive/blank_wall_lighting-xs.jpg 300w ,https://gadgetboy.org/media/posts/56/responsive/blank_wall_lighting-sm.jpg 480w ,https://gadgetboy.org/media/posts/56/responsive/blank_wall_lighting-md.jpg 768w ,https://gadgetboy.org/media/posts/56/responsive/blank_wall_lighting-lg.jpg 1024w\"  alt=\"Image description\" width=\"777\" height=\"584\" /></figure>\n<em>Image Credit: <a href=\"https://wistia.com/\">Wistia</a></em></p>\n<h2 id=\"camera-placement\">Camera Placement</h2>\n<p>Laptops are great but during typical use, you’ll be looking downward in your camera shot.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Will not make room of year. Raise camera height about a foot. Reframe. 4/10 <a href=\"https://twitter.com/BenGoldberger?ref_src=twsrc%5Etfw\">@BenGoldberger</a> <a href=\"https://t.co/nE9P4ygQm0\">pic.twitter.com/nE9P4ygQm0</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1337033809070583808?ref_src=twsrc%5Etfw\">December 10, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<p>No one wants to know the color of your ceiling and they certainly don’t want to look up your nose.</p>\n<p>If you have to use the webcam built into your laptop, position the camera so that it is at eye level. If you have to type or manipulate your screen, use an external keyboard and mouse. </p>\n<p>Placing your laptop on a table or desk on top of a stack of books works great.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/56/4-using-a-stack-of-books-768x1024.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/56/responsive/4-using-a-stack-of-books-768x1024-xs.jpg 300w ,https://gadgetboy.org/media/posts/56/responsive/4-using-a-stack-of-books-768x1024-sm.jpg 480w ,https://gadgetboy.org/media/posts/56/responsive/4-using-a-stack-of-books-768x1024-md.jpg 768w ,https://gadgetboy.org/media/posts/56/responsive/4-using-a-stack-of-books-768x1024-lg.jpg 1024w\"  alt=\"Laptop on Books\" width=\"768\" height=\"1024\" /></figure>\n<em>Image Credit: <a href=\"https://workremote.us/\">WorkRemote.us</a></em></p>\n<h2 id=\"the-basics-of-lighting\">The Basics of Lighting</h2>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Good angle. Bust of Jefferson. Twigs. Natural lighting needs tamping down. 8/10 <a href=\"https://twitter.com/agordonreed?ref_src=twsrc%5Etfw\">@agordonreed</a> <a href=\"https://t.co/j71PP4YsUt\">pic.twitter.com/j71PP4YsUt</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1337396254305890305?ref_src=twsrc%5Etfw\">December 11, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<ul>\n<li><strong>Place your brightest light (Wikipedia: <a href=\"https://en.wikipedia.org/wiki/Key_light\">key light</a>) in front of you.</strong> This can be a lamp behind your computer or even a window. It’s best to diffuse the light with a sheer curtain or shade so that it isn’t harsh and doesn’t over expose your face.</li>\n<li><strong>Use background lighting (Wikipedia: <a href=\"https://en.wikipedia.org/wiki/Fill_light\">fill light</a>).</strong> This could be a lamp across the room or track lighting aimed at a wall. Again, this shouldn’t be too bright as to distract the viewers eye or create imbalance in the frame, but bright enough to create some depth.</li>\n</ul>\n<blockquote>\n<p><strong>Pro Tip:</strong> Do your current surroundings make it difficult to get good lighting in front of you? Place your video conference window in the center of your screen, just below your camera. Open a word processor to a blank white page and move it to the left of the conference window. Do the same for the right side, then <strong>crank up the screen brightness</strong> to its highest level. It’s not as good as a true key light, but it works remarkably well. If your operating system supports it, also turn <strong>off</strong> Dark Mode.</p>\n</blockquote>\n<p><strong>How NOT to light yourself</strong></p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/56/lighting.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/56/responsive/lighting-xs.png 300w ,https://gadgetboy.org/media/posts/56/responsive/lighting-sm.png 480w ,https://gadgetboy.org/media/posts/56/responsive/lighting-md.png 768w ,https://gadgetboy.org/media/posts/56/responsive/lighting-lg.png 1024w\"  alt=\"Over exposed\" width=\"1005\" height=\"562\" /></figure></p>\n<p>This is me in what looks like a proof-of-life photo from a kidnapping. Notice the fill lighting on the wall to the right of the frame (good) but also the light coming from the window with the shade up on the left of the frame (bad). The right side of my face is completely over exposed.</p>\n<p>In an ideal world, I could just turn my desk toward the brightest light source (the window) but since my desk is in a fixed position, I have to learn to control it.</p>\n<p><strong>A Simple Fix</strong></p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/56/softer_lighting-2.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/56/responsive/softer_lighting-2-xs.png 300w ,https://gadgetboy.org/media/posts/56/responsive/softer_lighting-2-sm.png 480w ,https://gadgetboy.org/media/posts/56/responsive/softer_lighting-2-md.png 768w ,https://gadgetboy.org/media/posts/56/responsive/softer_lighting-2-lg.png 1024w\"  alt=\"Diffused Lighting\" width=\"1000\" height=\"556\" /></figure></p>\n<p>The shade in my office is of the up-down variety, meaning you can allow light into the room from the top or the bottom. Raising the lower part of the up-down shade diffuses the light, making it softer but still allows light above my head, onto the wall. (But probably still a bit too much on my forehead.) Still, it’s better than before. I could also close the blackout curtains so that there would be almost zero light coming from the window, then add a light in front of me and a second fill light on my other side.</p>\n<h2 id=\"sound\">Sound</h2>\n<p>Now that you look good, you need to <strong>sound</strong> good. People need to hear you clearly and the way to accomplish that is <strong>NOT</strong> to use the microphone and speakers on your laptop. Yes, some are OK, but trust me on this, most are not.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Pro post it note. Plants. Reposition slightly. Not factor in rating but headphones a distraction. 9/10 <a href=\"https://twitter.com/GoDragonsAD?ref_src=twsrc%5Etfw\">@GoDragonsAD</a> <a href=\"https://t.co/aclMexppfI\">pic.twitter.com/aclMexppfI</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1337564227289157633?ref_src=twsrc%5Etfw\">December 12, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<p>The easiest solution is to use a headset with a good quality microphone. Yes, the headset will appear in the shot, but it’s better than the alternative: good video with horrible audio. In fact, it’s been said many times that good audio is more important than good video. I tend to agree.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Well composed. Window. Chest. Art. Pillow. Plant. 9/10 <a href=\"https://twitter.com/BumillerNYT?ref_src=twsrc%5Etfw\">@BumillerNYT</a> <a href=\"https://t.co/tBlBydmqCl\">pic.twitter.com/tBlBydmqCl</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1337013273615605762?ref_src=twsrc%5Etfw\">December 10, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<p>If you don’t like a set of “cans” protruding out the sides of your head, use earbuds. Ever since they were first released in 2007, the microphone on the Apple Earpods has been outstanding. It’s especially good when you consider that they used to be included in the box for <strong>free</strong>. (I probably have half a dozen pairs around the house.) They’re comfortable to wear and if you don’t already own a pair, <a href=\"https://amzn.to/2W86n80\">you can pick them up for under $20</a>. The cable is a little short but you can fix that easily with a 3.5mm <a href=\"https://amzn.to/3mbCHS7\">TRRS extension cable</a>. (Make sure it’s <strong>TRRS</strong>, not <strong>TRS</strong>.)</p>\n<p>Bluetooth headphones will also work and you get the added bonus of not having any exposed wiring. My favorite pair of everyday Bluetooth headphones are the <a href=\"https://amzn.to/3r0do9c\">Sony WF-1000XM3</a>. They sound <strong>amazing</strong> and the microphones are very good, but they don’t look very good on camera. Case in point:</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Great detail. Globe. Models. Whimsy. May need new plant. 9/10 <a href=\"https://twitter.com/RyanPatelGlobal?ref_src=twsrc%5Etfw\">@RyanPatelGlobal</a> <a href=\"https://t.co/PoJhjQyt9M\">pic.twitter.com/PoJhjQyt9M</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1336451177215569921?ref_src=twsrc%5Etfw\">December 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<p>Many people I work with use <a href=\"https://amzn.to/3gG5Y5Z\">Apple Airpods</a>. The stem on each earbud that points down toward your mouth is a little distracting for viewers at first, but I’ve gotten used to seeing them. Most importantly, they have very good mic quality.</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Room Rater Holiday Update. <a href=\"https://twitter.com/PhilipRucker?ref_src=twsrc%5Etfw\">@PhilipRucker</a>’s decorated room is enjoying lots of sunlight and on air plaudits. 10/10. <a href=\"https://t.co/UyRKIpxuFw\">pic.twitter.com/UyRKIpxuFw</a></p>&mdash; Room Rater (@ratemyskyperoom) <a href=\"https://twitter.com/ratemyskyperoom/status/1337479761971585025?ref_src=twsrc%5Etfw\">December 11, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script> \n\n<h2 id=\"leveling-up\">Leveling Up</h2>\n<p>How can you shift your video conferencing from good to great?</p>\n<p>Stay tuned for Part 2 of this guide.</p>\n",
            "image": "https://gadgetboy.org/media/posts/56/youtv.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Video Production",
                   "Tutorial",
                   "Leadership",
                   "Audio Production"
            ],
            "date_published": "2020-12-12T07:56:51-06:00",
            "date_modified": "2022-02-18T08:07:14-06:00"
        },
        {
            "id": "https://gadgetboy.org/creating-in-public-a-new-series/",
            "url": "https://gadgetboy.org/creating-in-public-a-new-series/",
            "title": "Creating in Public: A New Series",
            "summary": "Welcome to a new series, Creating in Public. Creating in Public is&hellip;",
            "content_html": "<p>Welcome to a new series, <em>Creating in Public.</em> </p>\n<p><em>Creating in Public</em> is my journey back to the joy of media creation. </p>\n<p>You’re probably thinking, “Wait, isn’t media creation typically a public endeavour?” Well, yes, the final product is usually public, but in this series, I’m going to share everything <strong>as it happens</strong>.</p>\n<h2 id=\"background\">Background</h2>\n<p>During high school, I was the “AV Geek.” It was a perk of being a member of the AV Club and it occasionally got me out of classes to do stuff that I enjoyed.</p>\n<p>In college, I earned a double major: in addition to Marketing, I earned a BA in Media Production.</p>\n<p>I had an on-campus job managing AV in the student center and theater and got to experience new technologies that I would otherwise never have access to - things like the LCD projectors that we all take for granted now and wireless audio gear.</p>\n<p>And, yes, I was a DJ and radio personality on our college radio station. (Due to FCC regulations, the station was so low-powered that it only covered about 4 square miles. I used to joke on air, “<em>Welcome to WMAR! We’re a big cordless phone</em>!”) Then there was that time that students kept calling in to request <em>Rock Lobster</em> by the B52’s over and over again - so I played it for an hour. (The station manager was not pleased.)</p>\n<p>So, in 2005, when podcasting became a thing, I jumped in with both feet, <a href=\"https://web.archive.org/web/20061205232849/http://www.odmcast.com/podcast/\">producing a show</a> that had tens of thousands of downloads per month - small numbers by today’s standards, but we were very proud of the worldwide community we built. After a number of life changes by me and my co-hosts - new jobs, cross-country relocation - we finally ended the show. While we all enjoyed producing it, getting everyone to connect at the same time for recording was like herding cats.</p>\n<p>In 2012 I started <a href=\"https://www.youtube.com/channel/UC4JNMvDlG4ODohb-Nfz0rqg/videos\">another podcast</a> focused on the niche of event technology for a company that I co-founded. I wanted to meet as many industry trend makers as possible and an interview show was a great way to do that. It was particularly great at conferences where the organizers would provide us with some space to record interviews and capture video. After a couple of years, the organizers used to tout it as a benefit to attendees and sponsors. That came to an end when I left the company in late 2017.</p>\n<p>Since then, I’ve been heads down working at a ginormous tech company creating new software partnerships and building new products.</p>\n<p>As busy as I’ve been, I really missed the fun of producing media and a few months ago, decided to dive back into the pool.</p>\n<p>This series will cover the steps I have been (and will be) taking including:</p>\n<ul>\n<li>Creating a show concept based on a topic that I love, that works with my schedule and minimizes post-production</li>\n<li>Naming the show</li>\n<li>Setting up a new home studio including new audio gear and acoustic treatment</li>\n<li>Creating new workflows for the Linux desktop, including DAW’s, Windows Virtual Machines and other nerdy stuff</li>\n<li>Utilizing podcast technologies <em>that didn’t exist</em> even a few years ago</li>\n<li>Giving up some control to SaaS platforms, instead of self-hosting all my backend and frontend technology</li>\n<li>Securing interviews with industry leaders when I currently have zero listeners, using only my reputation and network of friends and colleagues to make connections</li>\n<li>Finding  and using royalty-free music and sound effects</li>\n<li>Adding video (when appropriate)</li>\n<li>Marketing and promoting the show</li>\n<li>Other Shenanigans</li>\n</ul>\n<h2 id=\"join-me\">Join Me</h2>\n<p>If you want to join me on this journey, sign-up for email updates (below) or go ahead and <a href=\"https://gadgetboy.org/feed\">subscribe to this blog in your favorite RSS reader</a>.</p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" src=\"https://createinpublic.substack.com/embed\" width=\"480\" height=\"320\" style=\"border:1px solid #EEE; background:white;\" frameborder=\"0\" scrolling=\"no\"></iframe></div>",
            "image": "https://gadgetboy.org/media/posts/55/mic_ham.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Podcasting",
                   "Linux",
                   "Gadgets",
                   "Creativity",
                   "Communication",
                   "Audio Production"
            ],
            "date_published": "2020-12-07T08:14:16-06:00",
            "date_modified": "2020-12-07T08:54:13-06:00"
        },
        {
            "id": "https://gadgetboy.org/from-full-stack-podcaster-to-pino/",
            "url": "https://gadgetboy.org/from-full-stack-podcaster-to-pino/",
            "title": "From Full-Stack Podcaster to PINO",
            "summary": "I started writing this in the comment section of an episode of&hellip;",
            "content_html": "<p>I started writing this in the comment section of <a href=\"https://podcastpontifications.com/episode/why-pinos-podcasters-in-name-only-own-the-future\">an episode of Podcast Pontifications</a> (“Why PINOs - Podcasters In Name Only - Own The Future”) and I decided to turn it into a blog post. You can subscribe to Podcast Pontifications in <a href=\"https://podcastpontifications.substack.com/\">newsletter</a> or <a href=\"https://www.podchaser.com/podcasts/podcast-pontifications-740003\">podcast</a> format. It’s also available on <a href=\"https://www.youtube.com/channel/UCldrmtlLrlNA8G2vz_Rs_OQ\">YouTube</a>, if that’s your thing.</p>\n<h2 id=\"original-gangster\">Original Gangster</h2>\n<p>OG Podcaster here, and I’m working on a concept for a new show.</p>\n<p>And, guess what?</p>\n<p>I’m <strong>only</strong> returning to podcasting because I no longer have to be what <a href=\"https://twitter.com/evoterra\">Evo Terra</a> refers to as a “full-stack podcaster”. </p>\n<p>A full-stack podcaster is someone who, back in the day, <strong>had</strong> to be well-versed in audio recording, editing and mixdown along with things like generating a properly formatted RSS feed so that your podcast could make its way into whatever podcast app your audience has chosen.</p>\n<p>I’ve produced and hosted two of my own shows since 2005. The first was a panel-style show that required herding the proverbial cats into my home studio every Thursday night (Remember, this was 2005 and things like Skype recording were still a PITA), edit the show, post it and do my best to promote it. I had so many issues with certain Wordpress plugins that I ultimately started creating my feeds by hand, using an application called <a href=\"https://reinventedsoftware.com/feeder/\">Feeder</a>, then hosting it on Amazon S3 and their Cloudfront Content Delivery Network (CDN).</p>\n<p>The second show was a little easier. Since it was an interview-style format and I produced it in support of my company, I could do it during “normal” working hours, but it was still a full-stack production.</p>\n<p>It was the first show, the <em>extracurricular activity</em>, that has pushed me toward my current mindset and the key thought is this: I will <strong>not</strong> produce another show unless I can have the simplest workflow possible.</p>\n<p>That’s it. That’s the most important part.</p>\n<p>The concept of the show is designed both around the content and creativity that make it work <strong>and</strong> the workflow. I had other creative concepts for the show but realized they would take up too much time and effort, and my day job already demands too much of my time. I want my next show to be a creative outlet and not something that feels like a second job.</p>\n<p>If nothing else, it has made me rethink my workflows and equipment.</p>\n<p>Let’s start there: equipment. </p>\n<h2 id=\"gear\">Gear</h2>\n<p>I am selling <strong>all</strong> of my outboard gear (vocal strips, noise gate, mixers, USB audio interface, portable recorders, etc.) and buying an <strong>all-in-one setup</strong> with onboard signal processing, simple mix-minus, etc. </p>\n<p>Right now, the <a href=\"https://amzn.to/37UNHzH\">Rodecaster Pro</a> is at the top of my list but I’m waiting for reviews of the <a href=\"https://www.bhphotovideo.com/c/product/1592739-REG/zoom_zp8_podtrak_p8_portable_multitrack.html\">Podtrak P8</a> from working podcasters and not just B&amp;H or Sweetwater, who both sell the device. (<a href=\"https://www.youtube.com/watch?v=xVUXqUKHx1o\">I like A.B.</a>, and think that he does thorough reviews, but I want a diversity of opinions.)</p>\n<p>I’ll keep my beloved <a href=\"https://amzn.to/3oMSn0i\">Sony MDR-7506</a> headphones, <a href=\"https://amzn.to/3kMDloW\">MXL 990</a>, Blue Encore 100 and <a href=\"http://recordinghacks.com/microphones/Kel-Audio/HM1\">Kel Audio HM-1</a>, but everything else will be sold on eBay or Craigslist.</p>\n<p>When dry, the <a href=\"https://amzn.to/3oS2Dor\">Blue Encore 100</a> sounds very similar to the Shure <a href=\"https://amzn.to/3ebaacW\">SM58</a> (which itself sounds very similar to the Shure <a href=\"https://amzn.to/35QRYS3\">SM7B</a>) so that will likely be my go-to mic.</p>\n<h2 id=\"editing-and-post-production\">Editing and Post-Production</h2>\n<p>I am <strong>completely</strong> sold on <a href=\"https://www.descript.com/\">Descript</a> and its ability to quickly transcribe and edit the audio using text. (And have you seen the Overdub feature?! Could there be anything more “PINO” than that?) The product is amazing and appears to be well worth the $24/month for the Pro plan. (Though paying for a year upfront is a little painful.)</p>\n<p>If I decide that I want to get into more detailed editing, Descript will export the timeline to <a href=\"https://www.reaper.fm/\">Reaper</a>, my preferred DAW on Linux.</p>\n<h2 id=\"hosting\">Hosting</h2>\n<p>Most recently, I self-hosted a Wordpress instance for the web site and a discrete Wordpress instance for the RSS feed. I uploaded the audio files to Soundcloud or Amazon S3.</p>\n<p>This time around, I’m going the SaaS route to help cut down my total production time. </p>\n<p>At the top of my list right now is <a href=\"https://www.captivate.fm/\">Captivate</a>. It looks like the best mix of features and price and if the show becomes popular, it can grow with me.</p>\n<h2 id=\"monetization\">Monetization</h2>\n<p>This isn’t even on my mind, right now. You can’t monetize without an audience, so I’m totally focused on creativity and growing a base of listeners. If the show becomes popular, I’ll worry about it then - <strong>but</strong> if I reach that point, I’m still going to let <strong>someone else</strong> sell the ad positions. I don’t have time for that.</p>\n<h2 id=\"does-all-of-this-make-me-a-pino\">Does all of this make me a PINO?</h2>\n<p>If you like what you hear, who cares?</p>\n",
            "image": "https://gadgetboy.org/media/posts/54/Blue_Encore_200.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Podcasting",
                   "Audio Production"
            ],
            "date_published": "2020-11-01T06:26:56-06:00",
            "date_modified": "2022-02-25T19:36:04-06:00"
        },
        {
            "id": "https://gadgetboy.org/cleaning-house/",
            "url": "https://gadgetboy.org/cleaning-house/",
            "title": "Cleaning House",
            "summary": "In my perpetual quest to learn something new and interesting, I gave&hellip;",
            "content_html": "<p>In my perpetual quest to learn something new and interesting, I gave this blog a complete overhaul.</p>\n<p>For years, I self-hosted it on Wordpress. That was a pain, primarily because (at the time) it was difficult to lock down Wordpress and protect it from getting hacked. Coupled with things like mySQL and PHP updates and stuff was breaking all the time. I spent more time tweaking it than actually writing.</p>\n<p>I moved it to Squarespace where it ran for a long time without issues until December 2018 when I made a DNS change (at the request of Squarespace) and it made the site unreachable. Squarespace support was of no help in fixing the issue, so I decided to move it to a basic Wordpress.com site using their Squarespace import tool.</p>\n<p>Wordpress.com is great. A fully-managed Personal blog is $4/month and, if you don’t want to use the traditional Wordpress interface, the new management interface is attractive and easy to use.</p>\n<p>Where it started to get annoying was when I wanted to do simple things like customize my CSS or add a Google Analytics tracking tag and found that a Personal plan doesn’t allow for that - you have to upgrade to a Premium plan.</p>\n<p>I get it - it’s SaaS and they have to price it properly to incentivize people to move up to plans with a higher ARPU. But I also know that some of these things are trivial to enable and it felt unnecessarily restrictive.</p>\n<p>So, during my <a href=\"https://gadgetboy.org/what-i-did-on-my-holiday-staycation-2020-edition/\">Holiday Staycation</a>, I began to explore <a href=\"https://www.netlify.com/blog/2020/04/14/what-is-a-static-site-generator-and-3-ways-to-find-the-best-one/\">static site generators</a>. Static sites are incredibly fast because there’s no server side processing of web pages - the web server simply delivers a pre-built file. More importantly, there’s no CMS running code so the attack vectors are (generally speaking) only the OS and the web server and not some insecure Wordpress plugin.</p>\n<p>I was reading a lot of Home Assistant docs (another Staycation project) and noticed that they were using <a href=\"https://jekyllrb.com/\">Jekyll</a>, so I decided to give it a try. I like the simplicity of page generation using plain text files, markdown and YAML and I found a highly regarded python script to import Wordpress posts so I could migrate my current content to static files.</p>\n<p>After some configuration, the import script worked great, but I was unable to figure out why I couldn’t get any theme other than the default to work. I finally ran out of tinker time and had to go back to the office.</p>\n<p>A few weeks later, while my wife was attending a Yoga immersive for the weekend, I started exploring other options. As it turns out, there <a href=\"https://staticsitegenerators.net/\">are <strong>a lot</strong> of static site generators out there</a>.</p>\n<p>Ultimately, I chose <a href=\"https://getpublii.com/\">Publii</a>. It’s an open source static site generator with a full GUI and lots of great features. There’s a built-in utility for Wordpress imports but then, as I was starting the process, I decided to take inventory of the content.</p>\n<p>Much of it is outdated (Review of the <a href=\"https://en.wikipedia.org/wiki/Treo_755p\">Palm Treo 755p</a>, anyone?) or the equivalent of what would be social media posts today.</p>\n<p>Sure, reviewing old posts was an interesting trip down Memory Lane but in the end, I decided to simply select posts to migrate manually, updating the URL structure and media file references accordingly.</p>\n<p>My intention is to host this on a spare Raspberry Pi on my home network, just so I can learn how to set up things like dynamic DNS, domain-based routing through the firewall and reverse proxy configuration but for now, it’s hosted on GitHub Pages.</p>\n<p>Publii is open source. If you want to support the project, you can contribute code or <a href=\"https://getpublii.com/donate/\">make a donation</a>. I make a monthly donation through <a href=\"https://opencollective.com/publii/\">Open Collective</a> but you can also make a donation via PayPal.</p>\n",
            "image": "https://gadgetboy.org/media/posts/52/delete_key2_1600.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Software"
            ],
            "date_published": "2020-09-23T17:23:52-05:00",
            "date_modified": "2022-02-25T19:17:09-06:00"
        },
        {
            "id": "https://gadgetboy.org/set-up-duplicacy-on-pop_os-2004/",
            "url": "https://gadgetboy.org/set-up-duplicacy-on-pop_os-2004/",
            "title": "Set Up Duplicacy on Pop!_OS 20.04",
            "summary": "I had no backup plan. I switched to Pop!_OS as my daily driver&hellip;",
            "content_html": "<h2>I had no backup plan.</h2>\n<p><a href=\"https://gadgetboy.org/review-system76-lemur-pro/\" title=\"Review: System76 Lemur Pro\" target=\"_blank\" rel=\"noopener noreferrer\">I switched to Pop!_OS as my daily driver </a>but I didn't yet move my files from my old MacBook Pro. Everything was backed up using Mac software, and I didn't have a plan for Linux backup.</p>\n<p>On the Mac, I backed up locally to a 1 TB external USB 3.0 drive using Time Machine and off-site to Dropbox <em>and</em> Amazon S3 using Arq Backup. Yeah, it was overkill, but you can't put a price on data loss, especially 25 years of family photos and videos.</p>\n<p>I also recently built a NAS system on my LAN for our family file storage, but it's not yet ready for backups, so I needed both a short term solution for my Linux laptop and a long term solution that I could use for all of our household backups.</p>\n<p>It doesn't matter what your preferred backup software is but, in general, I follow these basic guidelines:</p>\n<ul>\n<li><strong>Automate</strong> your backups on a regular schedule</li>\n<li>Have a <strong>local copy</strong> of your backups for quick retrieval (USB drive, NAS, etc.)</li>\n<li>Have an <strong>off-site/cloud copy</strong> of your backups for redundancy</li>\n<li>Check the <strong>integrity</strong> of your backups regularly</li>\n<li>Have a recovery <strong>plan</strong>. (Do you know how to recover your data, especially since your backup software was running on your now dead computer?)</li>\n</ul>\n<p>After investigating a number of backup solutions, including <a href=\"https://github.com/teejee2008/timeshift\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"TimeShift on GitHub\">TimeShift</a> and <a href=\"https://www.duplicati.com/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Duplicati Home\">Duplicati</a>, I decided upon <a href=\"https://duplicacy.com\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Duplicacy Backup Software\">Duplicacy</a>, mostly based upon community reviews.</p>\n<p class=\"msg msg--info\">Duplicacy is developed by <a href=\"https://acrosync.com\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Acrosync Home\">Acrosync</a>. If you're comfortable working with the command line, there is <strong>no cost for a CLI license</strong> since it's open source. <em>Thanks, Acrosync.</em></p>\n<p>While the core Duplicacy backup engine is open source, the web-GUI version is not, nor is it free. That's fine with me - I'm happy to contribute to open source projects through commercial offerings.</p>\n<p>The pricing for a personal license is a little outside the norm - not quite SaaS, not quite a one-time purchase - but I ended up getting a 5-year license for $40.</p>\n<p class=\"msg msg--info\">The Duplicacy web-GUI version has a lengthy free trial period, so you have plenty of time to decide if it works for you.</p>\n<p>Here's how to set it up.</p>\n<h2>Wizards and Magic</h2>\n<p>My experience with backup software has typically been wizard-driven:</p>\n<p>[Launch backup software]</p>\n<ol>\n<li>What files would you like to backup?</li>\n<li>Where do you want to put those files?</li>\n<li>Do you want those files to be encrypted?</li>\n<li>How often do you want to backup?</li>\n<li>How long do you want to keep your backups?</li>\n</ol>\n<p>[Save]</p>\n<p>After that, everything just backs up automagically.</p>\n<p>Duplicacy addresses all the same considerations, but instead of being wizard-driven, set up is performed using commands and configuration files. Luckily, I could ramp up quickly using the web-GUI version. I'll use this version for my laptop, but will use the command line version for backing up my NAS to the cloud.</p>\n<h2>Concepts</h2>\n<p>To get started with Duplicacy, you first need to understand some concepts and definitions. Again, wizard-driven backup solutions use these same concepts, but they're abstracted. In Duplicacy, they are explicit and uniquely configured. This approach took me a few minutes to get my head around, but now it makes perfect sense.</p>\n<h3>Repository</h3>\n<p>A Repository is the location of the files that you want to backup. (e.g. /home/yourdirectory or /etc/opt)</p>\n<h3>Snapshot ID</h3>\n<p>A Snapshot ID is a unique identifier for the repository you want to backup. For example, if you want to backup your home directory, you might give it a Snapshot ID of \"Home.\"</p>\n<h3>Revision</h3>\n<p>After the first backup of a repository, each subsequent backup generates a Revision. A revision contains the changes (additions, deletions, edits) since the last backup (sometimes referred to as Incremental or Differential backup). Revisions provide faster backups and conserve disk space.</p>\n<h3>Storage</h3>\n<p>Where will you store your backups? You will need to initialize that storage by providing a path to the local or remote file system. If you're backing up off-site to cloud storage, you'll need to authenticate with that service before you can select it as a backup location. The process of authenticating Duplicacy varies based on the service you're using, so I won't cover that here.</p>\n<p>Currently, Duplicacy supports the following backends:</p>\n<ul>\n<li>Local File System</li>\n<li>SFTP</li>\n<li>Dropbox</li>\n<li>Amazon S3 (or API equivalent)</li>\n<li>Wasabi</li>\n<li>DigitalOcean Spaces</li>\n<li>Google Cloud</li>\n<li>Microsoft Azure</li>\n<li>Backblaze B2</li>\n<li>Google Drive</li>\n<li>Microsoft OneDrive</li>\n<li>Hubic</li>\n<li>OpenStack Swift</li>\n<li>WebDav</li>\n</ul>\n<p><a href=\"https://forum.duplicacy.com/t/supported-storage-backends/1107\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Storage Backends on the Duplicacy Forum\">You can find details and CLI commands on the Duplicacy Forum.</a></p>\n<p>In my short term use case, I'll be backing up to a <a href=\"https://amzn.to/2zr7uaz\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Sandick High Endurance Micro SD Card 256 GB\">High Endurance Micro SD card</a> (Local File System) every few hours and Google Drive each night.</p>\n<p>When my NAS is properly set up, I plan to continue with the Micro SD card for hourly backups, use the NAS for nightly backups and use <a href=\"https://aws.amazon.com/glacier/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Amazon S3 Glacier &amp; S3 Glacier Deep Archive\">Amazon S3 Glacier</a> for weekly off-site backups.</p>\n<h3>Backup</h3>\n<p>A Backup is defined as the collection of files or directories you want to backup and the location where you want to put them. In order to configure a Backup, you first need to have initialized your Storage.</p>\n<h3>Schedule</h3>\n<p>A Schedule contains the timing of your backups (Day, time of day, etc.) and the Backup job you want to run. You can have multiple schedules for the same backup, multiple backups in a single schedule, etc. In order to configure a Schedule, you first need to have initialized your Storage and created at least one Backup.</p>\n<h3>Prune</h3>\n<p>The Prune function is similar to step 5 in the wizard-driven software example above but again, you need to explicitly define it. To do this, you need to create a Schedule that runs a Prune job, select the appropriate Backup, then indicate the parameters for when to start pruning data.</p>\n<h3>Restore</h3>\n<p>You can restore your data from any shapshot contained in your backup library. Keep in mind that these are not bootable system backups - only your data. If your Linux installation doesn't have a bootable recovery partition, you may want to keep a bootable USB drive handy in case of system failure.</p>\n<h3>Additional Concepts</h3>\n<p>There are some additional concepts and commands that you may want to explore, but the above is enough to get you started.</p>\n<h2>Setting up Duplicacy</h2>\n<h3>Installation</h3>\n<p>You have two options for installing the Duplicacy web version:</p>\n<ol>\n<li>Download a self-contained binary or;</li>\n<li>Build it from source.</li>\n</ol>\n<p>I selected the easiest option and <a href=\"https://duplicacy.com/download.html\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Download Duplicacy\">downloaded the binary for x64 systems</a>. Once downloaded, I ran a checksum to ensure that it wasn't corrupted.</p>\n<p><code>cd /home/gadgetboy/Downloads</code></p>\n<p><code>sha256sum duplicacy_web_linux_x64_1.3.0</code></p>\n<p> Next, I moved the application to /opt/Duplicacy</p>\n<p><code>sudo mkdir /opt/Duplicacy</code></p>\n<p><code>sudo mv /home/gadgetboy/Downloads/duplicacy_web_linux_x64_1.3.0 /opt/Duplicacy</code></p>\n<p>You also need to change permissions on the file so that it can be executed as a program. You can do this from the command line or using the Files application by right-clicking the file, selecting <strong>Permissions</strong>, then selecting the checkbox, \"Allow executing file as program.\"</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/duplicacy_permissions_markup.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/46/responsive/duplicacy_permissions_markup-xs.png 300w ,https://gadgetboy.org/media/posts/46/responsive/duplicacy_permissions_markup-sm.png 480w ,https://gadgetboy.org/media/posts/46/responsive/duplicacy_permissions_markup-md.png 768w ,https://gadgetboy.org/media/posts/46/responsive/duplicacy_permissions_markup-lg.png 1024w\"  alt=\"Set File as Executable in Files\" width=\"461\" height=\"493\">\n<figcaption >Set executable file permissions (Image Credit: me)</figcaption>\n</figure>\n<h4>Launching Duplicacy at Startup</h4>\n<p>Even though Duplicacy is now ready to launch, you'll want to do one more thing: make sure Duplicacy launches after a restart. Otherwise, your automated backups won't run unless you remember to launch Duplicacy every time you reboot your machine.</p>\n<p>Select the <strong>Activities</strong> menu in the Pop!_OS panel, in the top left corner. Select the <strong>Show Applications</strong> icon in the Dash, then find the <strong>Startup Applications</strong> app and launch it.</p>\n<p>Click <strong>Add</strong>, then enter the name of the application. Next, enter the path of the application or select it by navigating to it by clicking <strong>Browse...</strong> </p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/add_startup_program.png\" data-size=\"663x599\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/add_startup_program-thumbnail.png\" alt=\"Add Startup Program\" width=\"663\" height=\"599\"></a>\n<figcaption class=\"gallery-description\">Add Startup Program (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p class=\"msg msg--info\"><strong>Optional:</strong> If you're not the only user or administrator of this machine, you may want to enter a comment so that other people know why it's set to run at startup.</p>\n<p>Okay, we're finally ready to start backing up some files, so let's launch Duplicacy. It will load the control interface in your default web browser.</p>\n<p class=\"msg msg--highlight  msg--info\">The Duplicacy web-GUI version runs a small web server so that you can setup and manage it using a web browser. By default, it responds only to requests from <em>localhost</em> at 127.0.0.1:3875. If you'd like to change this configuration so you can access it remotely, you can do that by selecting <strong>Setting</strong> in the toolbar. I'm going to focus only on the localhost use case in this post. Review <a href=\"https://forum.duplicacy.com/t/how-to-access-the-duplicacy-web-interface-remotely/1664/7?u=christoph\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"How to access the duplicacy web-interface remotely\">this forum post</a> if you'd like learn how to setup remote access.</p>\n<h3>Application Password</h3>\n<p>Duplicacy will ask you to create a password to secure your credentials stored in local configuration files. You can choose to store this password in your Keychain. I use <a href=\"https://bitwarden.com/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Bitwarden Home\">Bitwarden</a> for all my passwords, so I unchecked this box.</p>\n<p class=\"msg msg--highlight \">You can click any of the images below to enlarge them.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_web_password.png\" data-size=\"1247x567\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_web_password-thumbnail.png\" alt=\"Duplicacy Web Password Entry\" width=\"768\" height=\"349\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Web Password Entry (Image Credit: Acrosync)</figcaption>\n</figure>\n</div></div>\n<p>Once your password has been configured, Duplicacy will load the Dashboard. There's nothing yet to see here since we haven't yet initializied Storage, created a Backup or set a Schedule.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_web_start.png\" data-size=\"1247x567\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_web_start-thumbnail.png\" alt=\"Duplicacy Web Start Up\" width=\"768\" height=\"349\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Web Start Up (Image Credit: Acrosync)</figcaption>\n</figure>\n</div></div>\n<h3>Identifying and Initializing Storage</h3>\n<p>To add a place to store your backups, select <strong>Storage</strong> from the toolbar, then select the \"<strong>+</strong>\" icon in the lower left corner of the screen. You'll be presented with the Storage configuration options.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_storage_configuration.png\" data-size=\"611x298\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_storage_configuration-thumbnail.png\" alt=\"Duplicacy Storage Selection\" width=\"611\" height=\"298\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Storage Selection (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>I'm going to continue on with own use case in this how-to, so I'll select a directory on my Micro SD card.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/select_storage_location.png\" data-size=\"614x546\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/select_storage_location-thumbnail.png\" alt=\"Select Storage Location for Backups\" width=\"614\" height=\"546\"></a>\n<figcaption class=\"gallery-description\">Select Storage Location for Backups (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>Finally, to initialize the Storage, you'll need to give it a name. You can optionally add a password used to encrypt your Storage (<strong>RECOMMENDED</strong>).</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/storage_name_password.png\" data-size=\"608x545\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/storage_name_password-thumbnail.png\" alt=\"Naming your Storage\" width=\"608\" height=\"545\"></a>\n<figcaption class=\"gallery-description\">Naming your Storage (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p class=\"msg msg--info\"><strong>Optional:</strong> Select the Copy-compatible checkbox to explicitly indicate that the source Storage is compatible with the destination storage.</p>\n<p>Execute this operation by clicking the <strong>Add</strong> button. Once completed, the Storage will appear when you select <strong>Storage</strong> from the toolbar. In the screenshot below, you'll see the storage for both my hourly backups to the Micro SD card (\"2004_Backups\") and my Nightly backups to Google Drive (\"Nightly\").</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/initialized_storage.png\" data-size=\"1276x853\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/initialized_storage-thumbnail.png\" alt=\"Initialized Storage\" width=\"768\" height=\"513\"></a>\n<figcaption class=\"gallery-description\">Initialized Storage (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<h3>Defining a Backup</h3>\n<p>Select <strong>Backup</strong> from the toolbar, then click the \"<strong>+</strong>\" button in the upper right corner. Here, you'll select the <strong>Directory</strong> (your files) that you want to backup, the destination (the initialized Storage created above) and a <strong>Backup ID</strong>. Give your Backup ID a memorable name like \"My_Home_Directory\" or \"My_Photos.\"</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/define_duplicacy_backup.png\" data-size=\"611x542\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/define_duplicacy_backup-thumbnail.png\" alt=\"Define a Backup in Duplicacy\" width=\"611\" height=\"542\"></a>\n<figcaption class=\"gallery-description\">Define a Backup in Duplicacy (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>Save this configuration by clicking the <strong>Save</strong> button. You'll return to the Backup screen where you will now see your new Backup configuration. In the screenshot below, you'll see both my local Backup (\"home\") and my Google Drive Backup (\"Offsite\").</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_configured_backup.png\" data-size=\"1277x849\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_configured_backup-thumbnail.png\" alt=\"Duplicacy Backup Configured\" width=\"768\" height=\"511\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Backup Configured (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>In theory, you could stop here. When you want to perform a backup, you could just click the green arrow/triangle below the Backup name, but we don't want to have to remember to do that - we want it to happen automatically.</p>\n<h3>Creating a Schedule</h3>\n<p>Select <strong>Schedule</strong> from the toolbar, then select the \"<strong>+</strong>\" icon in the lower left corner. Give your Schedule a name (e.g. \"Nightly\"), select the <strong>time of day</strong> you'd like it to start, select the <strong>frequency</strong> in which you want it to run, then select the <strong>day(s) of the week</strong> you would like it to run.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_create_schedule.png\" data-size=\"611x544\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_create_schedule-thumbnail.png\" alt=\"Creat a Schedule in Duplicacy\" width=\"611\" height=\"544\"></a>\n<figcaption class=\"gallery-description\">Creat a Schedule in Duplicacy (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p class=\"msg msg--highlight  msg--info\"><strong>Optional:</strong> Select the <strong>Maximum Run Time</strong>. I don't particularly grok the use case for this. Perhaps if it's a production machine, like a file server, you'd want to make sure it's finished before 9 AM, when people start working. Or, maybe, if it's your laptop and you need to leave for work at a certain time, you want to make sure you don't interrupt the job and corrupt the backup. Someone with more experience will have to give me a real use case. Personally, I want the job to finish, no matter how long it takes.</p>\n<h3>Testing</h3>\n<p>This is the last and most important step in any backup plan. If you don't validate your backup, it's like not having a backup at all.</p>\n<p>Click <strong>Backup</strong> from the toolbar.</p>\n<p>Run a manual Backup job by clicking the green arrow icon. If this is your first time, go get a cup of coffee. Or a cocktail. It could take a while.</p>\n<p>Once the job is completed, click <strong>Restore</strong> from the toolbar.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_restore.png\" data-size=\"1266x848\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_restore-thumbnail.png\" alt=\"Duplicacy Restore Screen\" width=\"768\" height=\"514\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Restore Screen (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>Select the initialized <strong>Storage</strong> where your backups are kept from the drop down menu, then select the <strong>Backup ID</strong> of your files. Now, select a <strong>Revision</strong>. This could be from any point in time as indicated by the time stamp at the end of each entry. Finally, indicate the directory where you'd like to put your restored files.</p>\n<p class=\"msg msg--info\">For information on <strong>Options</strong>, visit the <a href=\"https://forum.duplicacy.com/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Duplicacy forum\">Duplicacy forum</a>.</p>\n<p>After you've selected your revision, Duplicacy will present you with the files or directories contained within. Select the file or directory that you want to restore, then click the <strong>Restore</strong> button at the bottom of the screen. </p>\n<p>Your files will be unpacked and copied to the directory you've specified above.</p>\n<h3>Review Your Files</h3>\n<p>Does everything look OK? Is anything missing? Are you able to open your files? Yes?</p>\n<p class=\"msg msg--success\"><strong>Congratulations!</strong> You've set up the Duplicacy web-GUI version to backup your files automatically.</p>\n<h3>The Check Job</h3>\n<p>You've now setup Duplicacy and performed a successful backup and restore of your data, but do you plan to do that after <em>every</em> backup?</p>\n<p>Of course not.</p>\n<p>To ensure Snapshot integrity, you'll want to run the <strong>Check</strong> command. You can run a Check at any time but it's probably best to schedule a Check job after a completed backup.</p>\n<p>By default, the Check command will only verify that a referenced file chunk exists in your snapshots. If you want to automatically verify the integrity of each individual file, see <a href=\"https://forum.duplicacy.com/t/check-command-details/1081\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Check command details\">this post on the Duplicacy forum</a> for options.</p>\n<p>To setup a Check job, you can create a new schedule or add the job to an existing schedule. In my case, I've added it to my \"Nightly\" schedule so that it runs after each daily cloud backup.</p>\n<p>Once your schedule is created, click the \"<strong>+</strong>\" icon to add a new job. Select <strong>Check</strong> from the drop down menu, then select which <strong>Destination</strong> you want to check. To learn more about <strong>Options</strong>, visit the forum post linked above.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_add_new_check_job.png\" data-size=\"612x391\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_add_new_check_job-thumbnail.png\" alt=\"Add a new Check job in Duplicacy\" width=\"612\" height=\"391\"></a>\n<figcaption class=\"gallery-description\">Add a new Check job in Duplicacy (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<h3>Pruning</h3>\n<p>Technically, you're all set: your backups now run on an automated schedule and you can safely restore your data.</p>\n<p>But unless you have unlimited storage, you'll probably only want to keep backups around for a certain length of time.</p>\n<p>To configure this, we have to create a <strong>Prune</strong> job.</p>\n<p>To recap, I backup my home directory to the Micro SD card every 4 hours. Then, each night, I backup my home directory to Google Drive. (That's two Storage locations, two Backup jobs and two Schedules, if you're keeping track.)</p>\n<p>I created two daily Prune jobs for each referenced Backup.</p>\n<p>To create a Prune job, select <strong>Schedule</strong> from the toolbar, then select the \"<strong>+</strong>\" icon in the bottom left of the main screen to create a new schedule. In my case, I prune both my local backups and my cloud backups every 7 days. Choose what works for your peace of mind and your storage limitations.</p>\n<p>Give your schedule a logical name such as \"Prune_Local\" or \"Prune_Cloud.\" If you intend to run multiple jobs in the same schedule, name the schedule accordingly.</p>\n<p>Now, find your new schedule in the main screen and select the \"<strong>+</strong>\" icon to add a job to it. This is just like adding the Backup job that we covered above, but instead of selecting <strong>Backup</strong> from the drop down menu, we're going to select <strong>Prune</strong>.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_prune_setup.png\" data-size=\"613x532\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/46/gallery/duplicacy_prune_setup-thumbnail.png\" alt=\"Duplicacy Prune Job Setup\" width=\"613\" height=\"532\"></a>\n<figcaption class=\"gallery-description\">Duplicacy Prune Job Setup (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p>Next, select the <strong>Destination</strong> (your initialized Storage) that you want to Prune and configure your <strong>Retention Policy</strong>. Click <strong>Save</strong> to finish.</p>\n<p> </p>\nIf you found this how-to helpful, pay it forward.",
            "image": "https://gadgetboy.org/media/posts/46/duplicacy_backup_feature.png",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "Tutorial",
                   "Pop!_OS",
                   "Linux",
                   "How-to"
            ],
            "date_published": "2020-05-10T09:54:59-05:00",
            "date_modified": "2020-05-10T09:54:59-05:00"
        },
        {
            "id": "https://gadgetboy.org/protect-your-privacy-with-firefox-containers/",
            "url": "https://gadgetboy.org/protect-your-privacy-with-firefox-containers/",
            "title": "Protect your Privacy with Firefox Containers",
            "summary": "Absolute privacy is dead. There's just too much personal information and metadata&hellip;",
            "content_html": "<p>Absolute privacy is dead. </p>\n<p>There's just too much personal information and metadata about you collected from too many sources and you have no control over any of it - who has it, how it's used, how it can be combined - nothing. Privacy regulations like <a href=\"https://en.wikipedia.org/wiki/General_Data_Protection_Regulation\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"GDPR on Wikipedia\">GDPR</a> and <a href=\"https://en.wikipedia.org/wiki/California_Consumer_Privacy_Act\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"CCPA on Wikipedia\">CCPA</a> are a step in the right direction, but they won't protect you nearly as much as they claim.</p>\n<p>In the \"good old days,\" (prior to 1995) marketers and other users of personal information were basically limited to credit card data (sold by your credit card company, natch), public records (e.g. the car you own, your address) and consumer research.</p>\n<p>Today, there is a treasure trove of data available about you, your habits and your intentions based solely on your online activity. </p>\n<p>Going forward, the best you can hope for is to prevent further escape of your personal information and metadata into the wild. (Sometimes referred to as \"<a href=\"https://en.wikipedia.org/wiki/Data_exhaust\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Data Exhaust on Wikipedia\">data exhaust</a>.\")</p>\n<p>But how?</p>\n<h2>The use (and abuse) of Cookies</h2>\n<p>There are many types of strategies and tactics for capturing your personal metadata, but the greatest culprit is probably browser cookies.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/HTTP_cookie\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"HTTP Cookie on Wikipedia\">Cookies</a> were originally created by <a href=\"https://en.wikipedia.org/wiki/Netscape\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Netscape on Wikipedia\">Netscape</a> in the 1990's for use in their Navigator web browser. Their original design was to uniquely identify internet users to help ecommerce sites keep track of what items are in your shoppping cart.</p>\n<p>Since then, they've been used for a variety of reasons, almost all of which are designed to <strong>track you on the internet</strong>.</p>\n<p>Cross-site tracking cookies are the worst offenders.</p>\n<p>These cookies are delivered by companies like ad networks, analytics and research providers, social media sites and ecommerce sites, among others.</p>\n<p>Have you ever searched for something on Google, then saw an ad for it on a web site?</p>\n<p>What about Amazon?</p>\n<p>Facebook?</p>\n<p>Twitter?</p>\n<p>eBay?</p>\n<p>All of these companies use this tactic (called \"retargeting\" in ad industry parlance) but the worst part about it is not the relevant ads - that's actually a benefit to you - it's the massive amounts of data that these companies gather about you in the process: what sites you visit, when you use a web application (Hello, \"Login with Facebook\".), what purchases you're considering, what medications you may be taking, any health conditions you may have - the list goes on and on.</p>\n<p>You can do some things to help protect your privacy - use a privacy-respecting search engine like DuckDuckGo, turn on \"Do Not Track\" in your browser, install ad blockers in your browser - but if you're really serious about preventing data exhaust, the best thing you can do is to use a different web browser for every site you visit.</p>\n<p>Wait. What?! How is that even possible?!</p>\n<p>It's not. There are too many web sites and not enough browsers to use this strategy. Plus, it would be a huge pain in the ass.</p>\n<p>That's where <a href=\"https://support.mozilla.org/en-US/kb/containers\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Firefox Multi-Account Containers\">Firefox Multi-Account Containers</a> (\"Firefox Containers\") come to the rescue.</p>\n<h2>Firefox Multi-Account Containers</h2>\n<p>From the Mozilla web site:</p>\n<blockquote>\n<p class=\"msg msg--info\"><a href=\"https://addons.mozilla.org/firefox/addon/multi-account-containers/\">Multi-Account Containers</a> is a Firefox add-on that lets you separate your work, shopping or personal browsing without having to clear your history, log in and out, or use multiple browsers. Container tabs are like normal tabs except that the sites you visit will have access to a separate slice of the browser's storage. This means your site preferences, logged in sessions, and advertising tracking data won't carry over to the new container. Likewise, any browsing you do within the new container will not affect your logged in sessions, or tracking data of your other containers.</p>\n</blockquote>\n<p>I discovered Firefox containers last year when I began diving back into Linux as it's the default browser installed in many Linux distributions.</p>\n<p>Firefox has always been an excellent browser but over the years, I tended to use browsers that were faster (Safari) or had better plug-in support for the apps that I used (Chrome).</p>\n<p>Firefox containers changed all of that.</p>\n<p>Firefox is now the default browser on my personal machine, the browser I use for personal tasks on my work PC and even the default browser on my Android phone.</p>\n<p>Here's how I configure and use Firefox containers. Feel free to follow along with me.</p>\n<p>I'm assuming that you already have Firefox installed. If not, <a href=\"https://www.mozilla.org/en-US/firefox/new/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Download Firefox\">go ahead and do that</a>. Now, you're ready to get started with Firefox Multi-Account Containers.</p>\n<p>First, you have to <a href=\"https://addons.mozilla.org/en-US/firefox/addon/multi-account-containers/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Download Firefox Multi-Account Containers\">install the add-on from Mozilla</a> since it's not included by default. (It really should be.)</p>\n<p>Once that's done, you'll see a new icon in your toolbar:</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/Screenshot-from-2020-04-26-07-20-31.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-20-31-xs.png 300w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-20-31-sm.png 480w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-20-31-md.png 768w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-20-31-lg.png 1024w\"  alt=\"Firefox Multi-Account Containers Icon\" width=\"227\" height=\"90\">\n<figcaption >Firefox Multi-Account Containers Icon (Image Credit: me)</figcaption>\n</figure>\n<p>Selecting it will show you some sample containers that have already been created for you to use or test. I haven't completed a fresh install of this plugin in awhile, but the starter containers are usually:</p>\n<ul>\n<li>Personal</li>\n<li>Work</li>\n<li>Banking</li>\n<li>Shopping</li>\n<li>Facebook</li>\n<li>Twitter</li>\n</ul>\n<p>You can edit the name, color and icon to your liking. </p>\n<p>(Ignore the \"tmp\" containers you see below, for now. I'll explain them shortly.)</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/Screenshot-from-2020-04-26-07-23-13.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-23-13-xs.png 300w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-23-13-sm.png 480w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-23-13-md.png 768w ,https://gadgetboy.org/media/posts/45/responsive/Screenshot-from-2020-04-26-07-23-13-lg.png 1024w\"  alt=\"Firefox Multi-Account Containers Menu\" width=\"319\" height=\"593\">\n<figcaption >Firefox Multi-Account Containers Menu (Image Credit: me)</figcaption>\n</figure>\n<p>If you select \"Personal\" from this menu, it will launch a new Personal container.  Now, try this: visit any web site where you have an account, then login. (Not social media, yet.)</p>\n<p>Next, create a new Default tab using the standard Firefox controls. (\"Ctrl + T\" on Linux and Windows, \"Cmd + T\" on a Mac or clicking the \"+\" icon in the toolbar). Now, visit that same web site again in the Default tab. You'll immediately notice that you're not logged in to the site in that tab.</p>\n<p>That's because Firefox containers have (as the name implies) contained your activities for that web site within the Personal set of tabs (you can have as many container tabs open as your computer will allow). If this is a site that you login to frequently, you can check the box just below the page title in the Firefox containers menu, so that you can \"Always open in Personal.\" By doing that, any time you launch a new tab and enter the URL for that web site, regardless of the container you're using, Firefox will load that web site in the Personal container automatically.</p>\n<p>But wait - it gets better.</p>\n<h2>The Facebook Container</h2>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/facebook_container_icon.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/45/responsive/facebook_container_icon-xs.png 300w ,https://gadgetboy.org/media/posts/45/responsive/facebook_container_icon-sm.png 480w ,https://gadgetboy.org/media/posts/45/responsive/facebook_container_icon-md.png 768w ,https://gadgetboy.org/media/posts/45/responsive/facebook_container_icon-lg.png 1024w\"  alt=\"Facebook Container Fence Icon\" width=\"160\" height=\"27\">\n<figcaption >Facebook Container Fence Icon (Image Credit: me)</figcaption>\n</figure>\n<p>Now, install the <a href=\"https://addons.mozilla.org/en-US/firefox/addon/facebook-container/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Facebook Container on Mozilla.org\">Facebook Container</a> add-on. The Facebook Container is a special add-on that not only keeps your Facebook activity in the Firefox container, but it also blocks the loading of any Facebook cookies, code or off-site applications, such as \"Share to Facebook\" or \"Login with Facebook.\"</p>\n<p>Try it: open a tab in any other container, then visit any web site that has Facebook \"Share\" buttons. You'll see something like this. The tooltip text will load if you hover over the icon.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/45/gallery/facebook_container.png\" data-size=\"1276x383\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/gallery/facebook_container-thumbnail.png\" alt=\"Facebook Share Button Blocked\" width=\"768\" height=\"231\"></a>\n<figcaption class=\"gallery-description\">Facebook Share Button Blocked (Image Credit: Mozilla)</figcaption>\n</figure>\n</div></div>\n<p>If the Facebook share button is served from Facebook.com, the Facebook Container will deactivate the button and prevent Facebook from knowing that you visited that site.</p>\n<p>The same will happen if you visit a site that uses \"Login with Facebook.\"</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/45/gallery/allow_facebook.png\" data-size=\"1275x617\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/gallery/allow_facebook-thumbnail.png\" alt=\"Login with Facebook Blocked\" width=\"768\" height=\"372\"></a>\n<figcaption class=\"gallery-description\">Login with Facebook Blocked (Image Credit: Mozilla)</figcaption>\n</figure>\n</div></div>\n<p>You always have the option of over-riding this setting by clicking the button but then, you'll be exposing your online activites to Facebook - but at least the choice is <em>yours</em>.</p>\n<p>There are similar add-ons for <a href=\"https://addons.mozilla.org/en-US/firefox/addon/twitter-container/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Twitter Container Add-on on Mozilla\">Twitter</a>, <a href=\"https://addons.mozilla.org/en-US/firefox/addon/contain-amazon/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Amazon Container Add-on on Mozilla\">Amazon</a>, <a href=\"https://addons.mozilla.org/en-US/firefox/addon/google-container/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Google Container Add-on on Mozilla\">Google</a>, and other sites. I recommend you install as many of them as possible.</p>\n<h2>The Default Tab</h2>\n<p>I use keyboard shortcuts as much as possible. They enable me to accomplish things so much faster than navigating through application menus. So, if you're like me, that means you probably create tabs using \"Ctrl + T\" on Linux and Windows or \"Cmd + T\" on a Mac.</p>\n<p>When you do this, you launch a Default tab (and related container) in Firefox. Doing this means that the more frequently you use the Default tab, you're more likely to expose your online activites across sites.</p>\n<h3>Temporary Containers</h3>\n<p>To solve his problem, install the <a href=\"https://addons.mozilla.org/en-US/firefox/addon/temporary-containers/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Temporary Containers Add-on on Mozilla\">Temporary Containers</a> add-on. Next, go to the Add-ons menu item in Firefox, find Temporary Containers, select the ellipse menu, then select Preferences. This add-on is very configurable, but you don't need to worry about that. Select the checkbox for \"Automatic Mode\" then close that tab.</p>\n<p>Automatic Mode, as defined by the add-on creator:</p>\n<blockquote>\n<p class=\"msg msg--info\">Instantly reopen new tabs in Temporary Containers. You might lose the first few already typed characters in the address bar when reopening takes too long, but it prevents new tabs from writing and reading cookies in the default container.</p>\n</blockquote>\n<p>Now that the Temporary Containers tab is installed, any time you create a new tab using keyboard shortcuts or use the \"+\" icon on the toolbar, Firefox will create a new Temporary tab. When you close the tab, all of the cookies that were set in that tab will be deleted, erasing any trace of your visit to that site. </p>\n<p class=\"msg msg--highlight \"><strong>Note:</strong> unlike Private Windows, visits to sites in Temporary Containers will still show up in your browser history.</p>\n<p>But what happens if you use a Temporary container and wind up on a site where you have an account and would like to be remembered? Right-click the current tab and select the \"Reopen in Container\" menu, then select your chosen container. You can then select the Firefox containers icon in the toolbar and check the box to always open that site in that container.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/45/reopen_in_container.gif\" alt=\"Reopen in Container Animation\" width=\"386\" height=\"298\">\n<figcaption >Reopen in Container (Image Credit: me)</figcaption>\n</figure>\n<h2>Go Further</h2>\n<p>If you'd like to take additional steps to protect your privacy (and speed up your web browsing in the process) I recommend installing the following add-ons:</p>\n<ul>\n<li><a href=\"https://addons.mozilla.org/en-US/firefox/addon/ublock-origin/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"uBlock Origin add-on on Mozilla\">uBlock Origin</a></li>\n<li><a href=\"https://addons.mozilla.org/en-US/firefox/addon/ublock-origin/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Privacy Badger add-on on Mozilla\">Privacy Badger</a></li>\n</ul>\n<p>uBlock Origin is a fast ad-blocker that is efficient with resources. It doesn't hog a lot of memory or noticeably slow down your computer.</p>\n<p>Privacy Badger has some similar functionality, but it's main purpose is to automatically learn which sites are tracking you, then block them accordingly.</p>\n<p class=\"msg msg--highlight \"><strong>Note:</strong> like most ad blocking add-ons, these applications can sometimes prevent sites from working properly. If you find yourself in that situation, you can turn off uBlock Origin or Privacy Badger for that site while leaving them turned on for other sites you visit.</p>\n<h2>In Conclusion or \"Who has time for all this?\"</h2>\n<p>When I tell people about my use of Firefox Multi-Account Containers, inevitably, I receive questions like, \"How long did it take you to set this up?\" and \"Who has time for all this?\"</p>\n<p>Set up is easy - you can follow the instructions I've provided above and be done in 5 minutes or less. However, at the start, you do need to think differently about how you use your browser, but that's a short learning curve.</p>\n<p>Installing Temporary Containers helped me a lot here, since I no longer had to worry about accidentally opening something in a permanent Default container.</p>\n<p>I suggest you give it a try. You'll notice a significant drop in the number of re-targeting ads that you receive and that's <strong>the</strong> key indicator that it's working.</p>\n<p>If you find it too complicated for day-to-day use, you can always switch back to your usual browsing habits.</p>\n<h2>Bonus: Protect Your Privacy on Your Smartphone</h2>\n<p>Firefox on iOS doesn't support add-ons - and never will - due to Apple's strict software security model. On Android, the uBlock Origin and Privacy Badger add-ons can be installed, but not Firefox Multi-Account containers. (insert sad face here)</p>\n<p>This can be problematic as it exposes the data exhaust from your mobile browsing, but there are other things you can do to help prevent that.</p>\n<h3>Apps</h3>\n<p>If you use any of the sites mentioned above, all of them have their own apps for your phone. If you need to buy something on Amazon or search for something on Google, use the site's respective app. Generally speaking, any activity in those apps stays in those apps.</p>\n<p>My personal exception to this rule is Facebook. The Facebook app is notorious for not respecting privacy settings, like when you turn off Location Services for the app. Twitter is better, but still aggressive.</p>\n<p>For these sites, I use a separate browser: I installed Brave, a browser that, like Firefox, also helps protect your privacy. The only two sites that I use in Brave?</p>\n<p>Facebook and Twitter.</p>\n<p>Those two sites both have very good mobile web experiences and are the only way I can be certain that they're not tracking my location or other web activities.</p>\n<h3>Sensitive Searches</h3>\n<p>I use DuckDuckGo for web searches on both my laptop and smartphone. While I trust DuckDuckGo to not track me all over the web, that doesn't mean that I trust the sites to which it links.</p>\n<p>For this, I sometimes use the nuclear option for sensitive searches: <a href=\"https://www.mozilla.org/en-US/firefox/mobile/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Firefox Focus on Mozilla\">Firefox Focus</a>, a browser that clears everything from your device (including history) when the app is closed. It's available on both Android and iOS and, in practice, functions like the Temporary Containers add-on I described above.</p>\n<p>I use this when I'm searching for things that I don't want anyone to attribute to me. For example, a new cholesterol medication or mortgage refinancing rates. The first search and subsequent site visits to the sites in the search results may expose the fact that I have high cholesterol (I don't) and that's health data that no one needs to know, other than my doctor. The second protects me from incessant retargeting by mortgage lenders and brokers.</p>\n<p> </p>",
            "image": "https://gadgetboy.org/media/posts/45/shipping_containers_firefox.png",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
            ],
            "date_published": "2020-04-26T10:37:34-05:00",
            "date_modified": "2020-07-06T07:07:55-05:00"
        },
        {
            "id": "https://gadgetboy.org/review-system76-lemur-pro/",
            "url": "https://gadgetboy.org/review-system76-lemur-pro/",
            "title": "Review: System76 Lemur Pro",
            "summary": "I decided it was time to replace my aging 2015 MacBook Pro. Even&hellip;",
            "content_html": "<p>I decided it was time to replace my aging 2015 MacBook Pro. Even though it's still in mint physical condition with a beautiful HiDPI (\"Retina\") display and is generally great to type on, the battery was beginning to show its age and it will become ineligible for OS upgrades in the near future.</p>\n<p>I experimented with a Chromebook for a short while, then found myself <a href=\"https://gadgetboy.org/my-new-chromebook-isnt-a-chromebook-at-all/\" target=\"_blank\" rel=\"noopener noreferrer\">running Pop!_OS on a 13\" Dell 2-in-1</a>, which I've enjoyed a lot. Using that machine has generally been a great experience, especially since Ubuntu seems to support all the hardware. My only complaint has been the trackpad - it's just not as precise as I'm used to and can be really frustrating to use. (It's not a Linux problem - it's the same running Windows 10.)</p>\n<p>While immersing myself in some projects at home, I decided that I wanted a more powerful machine with a bigger, matte screen and a passable trackpad. After much deliberation, I bought a <a href=\"https://www.dell.com/en-us/shop/dell-laptops/new-inspiron-15-7000-laptop/spd/inspiron-15-7591-laptop\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell Inspiron 15 7591\">Dell Inspiron 15 7591</a>. It's an awesome machine that's a joy to type on and, with a 32 GB RAM kit and NVIDIA Graphics, it's screaming fast. The trackpad is pretty damn good, too, and the aluminium shell feels and looks great. It supports two NVMe drives and yet another 2.5\" mass storage drive (SSD, Hybrid or Hard Drive). It's a beautiful beast that won't break the bank.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/inspiron_7591.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/43/responsive/inspiron_7591-xs.png 300w ,https://gadgetboy.org/media/posts/43/responsive/inspiron_7591-sm.png 480w ,https://gadgetboy.org/media/posts/43/responsive/inspiron_7591-md.png 768w ,https://gadgetboy.org/media/posts/43/responsive/inspiron_7591-lg.png 1024w\"  alt=\"Dell Inspiron 15 7591\" width=\"1140\" height=\"473\">\n<figcaption >Image Credit: Dell</figcaption>\n</figure>\n<p> </p>\n<p>(Full Disclosure: <a href=\"https://www.linkedin.com/in/johnfederico/\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"John Federico on LinkedIn.com\">I work for Dell</a> running software partnerships, making this post a little...uncomfortable to write. I'm not involved in the hardware side of the business in any way other than I can sometimes get my hands on some machines before they're released to the <a href=\"#mcetoc_1e5km0bsc0\" title=\"Footnotes\">public*</a>.) <span data-offset-key=\"7su1a-0-0\">😉</span></p>\n<p>I was generally in love with the 7591, but there was just one problem with it: I couldn't get it to properly run any flavor of Linux. Even though the machine is <a href=\"https://certification.ubuntu.com/hardware/201903-26880\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell Inspiron 15 7591 Ubuntu Certification\">Ubuntu Certified</a> (which is a key reason I chose it), I couldn't get the PCI sound card to work. USB audio input and output both worked fine, but troubleshooting the built-in sound card was an exercise in frustration.</p>\n<p>I think we all take for granted that our laptops can play sound until you find yourself trying to learn something from a YouTube video and have to switch to a different PC or your smartphone.</p>\n<p>Since the machine didn't ship with Ubuntu pre-installed, I was unable to get support from Dell. Look, I get it: successfully supporting millions of consumers (many of them not very tech savvy) is no small feat. If you buy a new car, then completely replace the engine with something else, you can't expect the manufacturer to support it. This appears to be industry wide, not just at Dell. (Though, I will ask, why bother certifying a PC for Ubuntu if you're not going to support it with that OS? But, I digress...)</p>\n<p>The Pop!_OS and Ubuntu communities are great resources, but I finally gave up after three weeks and sold it on eBay. The shop where I bought the 32 GB RAM kit won't accept returns unless the memory is DOA and I didn't feel like negotiating the restocking fee on the PC, nor create a support incident for the Dell support team to deal with - with so many people working from home now, they are likely overwhelmed. It was easier to just restore the Windows 10 OS factory image and sell it as \"New, Open Box.\"</p>\n<p>So, even as I returned to my 13\" machine, I was trying to figure out my options. I didn't want to spend a ton of money on a PC that wasn't my daily driver, I wasn't willing to buy a similar machine and hope for a better trackpad and, most importantly, I didn't want to have to wrestle with a PC from any major OEM to get Linux running on it. Even users of Thinkpads, which are famously great for supporting Linux across the product line, were having issues getting Ubuntu to run properly on models that I would have considered.</p>\n<p>I wanted a Linux machine with hardware support out of the box, but any device with Linux pre-installed from a major PC OEM is typically sold as a \"<a href=\"#mcetoc_1e5km0bsc0\" title=\"Footnote\">Developer Edition*</a>,\" which means it's <a href=\"https://www.dell.com/en-us/work/shop/overview/cp/linuxsystems\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell Project Sputnik\">built - and priced - for business use</a>.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://gadgetboy.org/media/posts/43/System76-System76_Logo_Blue-by_Kate_Hazen_of_System76.jpg\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/43/responsive/System76-System76_Logo_Blue-by_Kate_Hazen_of_System76-xs.jpg 300w ,https://gadgetboy.org/media/posts/43/responsive/System76-System76_Logo_Blue-by_Kate_Hazen_of_System76-sm.jpg 480w ,https://gadgetboy.org/media/posts/43/responsive/System76-System76_Logo_Blue-by_Kate_Hazen_of_System76-md.jpg 768w ,https://gadgetboy.org/media/posts/43/responsive/System76-System76_Logo_Blue-by_Kate_Hazen_of_System76-lg.jpg 1024w\"  alt=\"System76 Branded Desktop Image\" width=\"640\" height=\"360\"></figure>\n<p>So, I started searching for other PC's with Linux pre-installed and, not surprisngly, System76 kept popping up with great reviews and a huge community of super fans. Of course, I knew of System76 as they're the creator and maintainer of Pop!_OS, but I was still thinking (hoping?) that I could get a better spec'd and more economical machine from Dell that would run Linux.</p>\n<p>As I was overthinking the whole decision, I made my 3,000th visit to the Sytem76 web site so I could (again) configure a 15\" <a href=\"https://system76.com/laptops/darter\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Darter Pro on System76.com\">Darter Pro</a> machine and noticed that System76 was about to release a new PC - the 2020 14\" <a href=\"https://system76.com/laptops/lemur\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Lemur Pro on System76.com\">Lemur Pro</a>.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/lemur_pro.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/43/responsive/lemur_pro-xs.png 300w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro-sm.png 480w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro-md.png 768w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro-lg.png 1024w\"  alt=\"Lemur Pro\" width=\"952\" height=\"582\">\n<figcaption >Image Credit: System76</figcaption>\n</figure>\n<p> </p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/lemur_pro_angles.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/43/responsive/lemur_pro_angles-xs.png 300w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro_angles-sm.png 480w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro_angles-md.png 768w ,https://gadgetboy.org/media/posts/43/responsive/lemur_pro_angles-lg.png 1024w\"  alt=\"Lemur Pro from different angles\" width=\"1327\" height=\"769\">\n<figcaption >Image Credit: System76</figcaption>\n</figure>\n<p>In addition to all of the other benefits of a System76 machine (Disabled Intel ME, CoreBoot open source firmware, full Pop!_Os support, etc.) they were touting 14 hours of battery life, a 10th Gen Intel Core processor, a matte 1080p display and up to 40 GB of RAM in a slim, attractive PC with a modern, no-button trackpad.</p>\n<p>I subscribed to the Early Access mailing list and put it out of my mind for awhile. (Probably only a day or so, if I'm being honest with myself.) About a week later, while I was literally dealing with the frustration of using the trackpad on my current machine, I received an email from System76 informing me that I could place one of the first orders for a Lemur Pro. (True to their word, only customers who showed early interest could configure and order one. Random web site visitors had to wait another day or so. That impressed me.)</p>\n<p>I configured and ordered a Lemur Pro with 40 GB RAM and a 512 GB NVMe drive. (I can still add another NVMe drive, if I have a need for it.)</p>\n<p>The next morning, I received both a friendly email and a phone call from System76, letting me know that my order was processed and that it was in the production queue. (Each System76 machine is built-to-order.) 24 hours later, I received another email message telling me that my machine was built and on its way to me via UPS.</p>\n<p>My Lemur Pro arrived four days later. UPS required a signature for delivery but I was able to just flash my ID through the glass on our front door and the driver left it on the porch - a perfect COVID-19, no-contact delivery.</p>\n<h2>Unboxing</h2>\n<h3>First Impressions</h3>\n<p>I'm not going to lie: when I was exploring Linux distros, one of the reasons I was attracted to Pop!_OS was the brand messaging, desktop graphics and overall user experience of the OS. I found their packaging to be consistent with that and right on-brand. </p>\n<p>In what appears to be taking a queue from Apple, System76 ships the device secured in a reusable plastic-and-cardboard mechanism. It's worth keeping around in case you need to ship your machine for service or maybe want to sell it in the future.</p>\n<p>The envelope containing System76 and Pop!_OS stickers was a nice touch.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_closed_box.jpg\" data-size=\"3052x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_closed_box-thumbnail.jpg\" alt=\"System76 sealed box\" width=\"768\" height=\"459\"></a>\n<figcaption class=\"gallery-description\">System76 sealed box</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_box_unleash.jpg\" data-size=\"2893x1796\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_box_unleash-thumbnail.jpg\" alt=\"System76 box side closeup\" width=\"768\" height=\"477\"></a>\n<figcaption class=\"gallery-description\">System76 box side closeup</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_box_inside_cover.jpg\" data-size=\"3284x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_box_inside_cover-thumbnail.jpg\" alt=\"System76 inside box cover\" width=\"768\" height=\"427\"></a>\n<figcaption class=\"gallery-description\">System76 inside box cover</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_in_box.jpg\" data-size=\"1824x2232\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_in_box-thumbnail.jpg\" alt=\"System76 inside box cover with Lemur Pro\" width=\"768\" height=\"940\"></a>\n<figcaption class=\"gallery-description\">System76 inside box cover with Lemur Pro</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_packaging_front.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_packaging_front-thumbnail.jpg\" alt=\"System76 Lemur Pro packaging, front\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro packaging, front</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_packaging_behind.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_packaging_behind-thumbnail.jpg\" alt=\"System76 Lemur Pro packaging, behind\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro packaging, behind</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_power_supply_packaging.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_power_supply_packaging-thumbnail.jpg\" alt=\"System76 Lemur Pro power supply packaging\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro power supply packaging</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_inside_box_bottom.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_inside_box_bottom-thumbnail.jpg\" alt=\"System76 Lemur Pro, inside bottom of box\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro, inside bottom of box</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_bottom.jpg\" data-size=\"3561x1814\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_bottom-thumbnail.jpg\" alt=\"System76 Lemur Pro bottom\" width=\"768\" height=\"391\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro bottom</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_closed_1.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_closed_1-thumbnail.jpg\" alt=\"System76 Lemur Pro with lid closed\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro with lid closed</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_opened.jpg\" data-size=\"1824x2209\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_opened-thumbnail.jpg\" alt=\"System76 Lemur Pro opened\" width=\"768\" height=\"930\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro opened</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_with_power_supply.jpg\" data-size=\"1824x3174\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_with_power_supply-thumbnail.jpg\" alt=\"System76 Lemur Pro with power supply\" width=\"768\" height=\"1336\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro with power supply</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_envelope.jpg\" data-size=\"3419x1820\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_envelope-thumbnail.jpg\" alt=\"Lemur Pro with System76 branded envelope\" width=\"768\" height=\"409\"></a>\n<figcaption class=\"gallery-description\">Lemur Pro with System76 branded envelope</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_envelope_opened.jpg\" data-size=\"4000x1824\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_envelope_opened-thumbnail.jpg\" alt=\"Contents of the System76 branded envelope\" width=\"768\" height=\"350\"></a>\n<figcaption class=\"gallery-description\">Contents of the System76 branded envelope</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_welcome_card.jpg\" data-size=\"1824x2502\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_welcome_card-thumbnail.jpg\" alt=\"System76 Welcome Card\" width=\"768\" height=\"1053\"></a>\n<figcaption class=\"gallery-description\">System76 Welcome Card</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_first_boot.jpg\" data-size=\"1824x2119\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/system76_lemur_pro_first_boot-thumbnail.jpg\" alt=\"System76 Lemur Pro first boot\" width=\"768\" height=\"892\"></a>\n<figcaption class=\"gallery-description\">System76 Lemur Pro first boot</figcaption>\n</figure>\n</div></div>\n<h3>Weight &amp; Design</h3>\n<p>The Lemur Pro is as powerful as the current MacBook Pro but weighs <em>less.</em> <strong>I</strong>t's also lighter than the current MacBook Air and even ligher than the amazing <a href=\"https://www.dell.com/en-us/shop/dell-laptops/new-xps-13-2-in-1-laptop/spd/xps-13-7390-2-in-1-laptop\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"XPS 7391 on Dell.com\">XPS 13\" 7391</a> that I use every day at work. (Though, to be fair, the 7391 is a 2-in-1 and has some added weight due to the touchscreen and sophisticated hinge mechanism.)</p>\n<p>The Lemur Pro is so light that I can load both my work machine <em>and</em> my personal machine into my backpack and not even realize that I'm carrying two PC's. Even better, both machines can be powered by USC Type-C Power Delivery, so I only have to carry one charger. This will be great for business trips, when I want to work on personal projects after hours or watch movies on the plane.</p>\n<p>The design is the same as what you would expect from any top-tier PC OEM. It has clean lines and relatively modern design touches. The System76 logo on the lid appears to be laser etched.</p>\n<p>The biggest and most obvious design decision was the webcam. Rather than increase the size of the bezel, System76 decided to add a small bump above the screen to house the camera and built-in microphone. It's not distracting at all when using the machine, but obviously protrudes by a few millimeters when the lid is closed. I'm hoping that the chassis will adequately protect it during transit.</p>\n<p>For some unknown reason, System76 made the decision to place the power button on the right<strong> side</strong> of the machine, not on the keyboard deck. Depending on your perspective, this could be a poor design choice, something to just get used to, or both.</p>\n<p>During my first full day of using the Lemur Pro, I plugged-in a USB Type-C cable with Power Delivery and DisplayPort (which is on the left side) so that I could use it with my <a href=\"https://amzn.to/2K9NA6f\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell U3818DW\">38\" Dell display</a> to get some work done. Naturally, since the machine is so light, I braced it with my right hand and accidentally pushed the power button, putting it into Suspend mode. I definitely need to remember that in the future.</p>\n<h3>Materials &amp; Build Quality</h3>\n<p>At the time this post is written, System76 doesn't indicate what materials are used to build the Lemur Pro chassis on its web site. While looking at the photos during the buying process, I guessed that it was a nice, Thinkpad-like plastic or some kind of aluminum or magnesium alloy.</p>\n<p>After it arrived, I realized it was metal but didn't know what kind, so I asked the System76 support team and they responded almost immediately:</p>\n<blockquote>\n<p class=\"msg msg--highlight \">Hello John,<br><br>Glad you're enjoying the Lemur Pro! The chassis is made out of Magnesium-Aluminum alloy: 9% Aluminum, 90% Magnesium, 1% other material. (Before you ask, I do not know what the \"other material\" is; I assume our supplier simply includes that as a tolerance.) Please let us know if you have any other questions! --Jacob</p>\n</blockquote>\n<p><em>Thanks, Jacob.</em></p>\n<p>The Magnesium-Aluminum alloy is smooth to the touch and in my short time using it, appears to reject fingerprints. (Though, System76 includes a microfiber cloth with the system, so perhaps this is a premature observation.) It has tiny reflective flecks of material that only appear in the right light and from the right perspective. This may be a conscious design choice or just a natural characteristic of the alloy. Those flecks might also be the \"1% other material\" but I'm just guessing.</p>\n<p>Fit and finish are excellent with no visible gaps or imperfections. There is no flexing of the chassis or the keyboard deck - it's a solid typing experience. In fact, it's one of the best keyboards I've used in a long time, almost on par with my 2015 MacBook Pro.</p>\n<p>The bottom panel flexes a wee bit but it doesn't detract from the overall build quality of the machine. I've only noticed it when I close the lid and grip the PC with one hand.</p>\n<p>The 14.1\" 1080p screen has a matte finish and is bright, crisp and seemingly color accurate. The Lemur Pro's screen is pleasingly larger than my 13\" devices and the form factor is just about perfect.</p>\n<p class=\"msg msg--info\">Even though it would be nice to have a larger screen on-the-go, I recently discovered that the tradeoffs of a 15.6\" machine just aren't worth it - especially the keyboard layout.</p>\n<p class=\"msg msg--info\">I don't understand why just about every PC OEM feels the need to fill the keyboard deck of larger devices with a number pad, shifting the trackpad and keyboard to the left. It's an awkward experience. Instead of the number pad, why not center the keyboard and add front-firing speakers on each side or maybe just a fingerprint reader that <em>actually works</em> more than 20% of the time? Anyone who really needs a number pad can get one from <a href=\"https://amzn.to/2XENFXu\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"USB Numbers Pads on Amazon.com\">Amazon for less than $20</a>.</p>\n<h4>Trackpad</h4>\n<p>The trackpad on this machine is excellent. Is it as good as a MacBook Pro or a Dell XPS? Not quite, but it's pretty damn close. The fact that it doesn't have buttons is a real plus.</p>\n<h4>Power Supply</h4>\n<p>From the perspective of portability, the power supply is great. It's relatively small and lightweight and gets the job done. And while System76 definitely considered the needs of road warriors and hallway walkers with the Lemur Pro's great battery life, they missed the mark with the power supply. The total length of the cables is so ridiculously short, it's almost comical. I'm going to have to carry an extension cord or find a longer main lead with the right connector for the power supply.</p>\n<p>Everything else about the device is so well thought out that this decision left me scratching my head.</p>\n<p class=\"msg msg--highlight \"><strong>Update:</strong> Right now, I'm using a spare power cord from a Sonos speaker that's 6 feet long for the main lead, but you can replace it with a <a href=\"https://amzn.to/3cw9FrE\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Non-Polarized 10ft AC Power Cord\">high quality, non-polarized cord for around $8 USD</a>.</p>\n<h3>Performance</h3>\n<p>First, let's look at the specs of my particular configuration, outlined in the table below.</p>\n<table data-v-7b22f3a8=\"\">\n<tbody data-v-7b22f3a8=\"\">\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Operating System</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Pop!_OS 19.10 (64-bit)</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Firmware</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>System76 Open Firmware (Coreboot, EDK2, System76 Firmware Apps)</p>\n<p>System76 Open Source Embedded Controller Firmware</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Processor</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>10th Gen Intel® Core i7-10510U<strong>:</strong> 1.8 GHz (up to 4.9 GHz burst mode) - 8MB Cache - 4 Cores - 8 Threads (<em>upgraded from i5</em>)</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Display</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>14.1″ 1920×1080 FHD, Matte Finish</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Graphics</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Intel® UHD Graphics</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Memory</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>40 GB DDR4 @ 2666 MHz</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Storage</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>1× M.2 NVMe SSD @ 512 GB</p>\n<p>Sequential Read Speed: 3,500 MB/s, Sequential Write Speed: 3,200 MB/s</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Expansion</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>USB 3.1 Type-C, 2× USB 3.0 Type-A, MicroSD Card Reader</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Input</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Multitouch Clickpad, Backlit US QWERTY Keyboard</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Networking</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Intel® Wireless-AC Wi-Fi, Bluetooth</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Video Ports</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>HDMI, USB 3.1 Type-C w/ DisplayPort</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Audio</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Stereo Speakers, 1× Headphone/Microphone Combo (TRRS)</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Camera</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>720p HD Webcam</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Security</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Disabled Intel ME, Kensington® Lock</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Battery</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>Li-Ion - 73 Wh</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Charger</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>65 W, AC-in 100–240 V, 50–60 Hz</p>\n<p>65W+ USB Type-C Charging Compatible</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Dimensions</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>12.64″ × 8.5″ × 0.61″ (32.1 × 21.6 × 1.55 cm)</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Weight</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>2.2 lbs (.99kg)</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Warranty</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>1 Year</p>\n</td>\n</tr>\n<tr data-v-7b22f3a8=\"\">\n<td data-v-7b22f3a8=\"\"><strong>Price as configured</strong></td>\n<td data-v-7b22f3a8=\"\">\n<p>$1,688 + $32 for UPS Ground shipping</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h4>First Boot</h4>\n<p>I chose to capture the unboxing in photos and not video as my other cameras and tripods are in storage at the moment. So, when it came to booting the machine for the first time, I wanted to snap a few photos of the process.</p>\n<p>The Lemur Pro boots so fast that I couldn't even unlock my phone quickly enough to take a picture! In seconds, the machine booted into system setup.</p>\n<p>If you've ever installed Pop!_OS on your machine, the experience of having it installed on a new PC is exactly the same as booting from a live session: select your country, keyboard layout, disk encryption preference, etc. When it's done, it will ask you to create a user, after a restart.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/neofetch.png\" data-size=\"801x454\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/neofetch-thumbnail.png\" alt=\"neofetch on my System76 Lemur Pro\" width=\"768\" height=\"435\"></a>\n<figcaption class=\"gallery-description\">neofetch on my System76 Lemur Pro (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<h4>Processor &amp; GPU</h4>\n<p>The CPU is a 10th Generation Intel i7 processor (an upgrade from the 10th Gen i5 in the base model Lemur Pro) in the \"U\" spec, which indicates that it's designed for Ultrabooks that require longer battery life. Spec-for-spec, it certainly doesn't pack the horsepower of the Dell Inspiron 7591 that I gave up.</p>\n<p class=\"msg msg--info\">The Dell Inspiron 7591 has a 9th Gen Intel i7 in the \"H\" spec (high performance) with 6 cores - 12 threads, 12 MB cache and burst mode up to 4.5 GHz. More importantly, it has a dedicated NVIDIA GPU which helps render video faster. (And improves gaming performance, but I'm not much of a gamer.)</p>\n<p>With that said, the Lemur Pro definitely punches above its weight. It's surprisingly fast for its specs and the onboard Intel GPU works well, powering both the built-in display and my <a href=\"https://amzn.to/3cwwFXN\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell U3818DW Curved Display\">large (3840 x 1600) external display</a> simultaneously. Video playback and video conferences are smooth and consistent.</p>\n<p>It quickly renders web pages in Firefox, which is typically a small step behind the speed of the Chromium and WebKit rendering engines.</p>\n<p><strong>GeekBench</strong></p>\n<p>Running Geekbench5, the Lemur Pro scored better in Multi-core tests than the Intel 8th Gen U series processor in a Dell Inspiron 7386, but lower in Single-core tests. You can see the full results of the Lemur Pro test <a href=\"https://browser.geekbench.com/v5/cpu/1817319\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"GeekBench Scores for the System76 Lemur Pro\">here</a> and the Dell test <a href=\"https://browser.geekbench.com/v5/cpu/1717304\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"GeekBench 5 test results for the Dell Inspiron 7386\">here</a>.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/geekbench.png\" data-size=\"886x143\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/geekbench-thumbnail.png\" alt=\"GeekBench5 results on my System76 Lemur Pro\" width=\"768\" height=\"124\"></a>\n<figcaption class=\"gallery-description\">GeekBench5 results on my System76 Lemur Pro</figcaption>\n</figure>\n</div></div>\n<p>Here's the obligatory screenshot of HTOP running in a terminal window. I was running the following apps:</p>\n<ul>\n<li>Firefox (at least 20 tabs &amp; windows)</li>\n<li>Zoom</li>\n<li>Pidgin</li>\n<li>Visual Studio Code</li>\n<li>Microsoft Teams</li>\n<li>Slack</li>\n<li>Publii</li>\n<li>Signal</li>\n<li>Flameshot</li>\n</ul>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://gadgetboy.org/media/posts/43/gallery/htop.png\" data-size=\"1425x850\"><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/gallery/htop-thumbnail.png\" alt=\"HTOP on my System76 Lemur Pro\" width=\"768\" height=\"458\"></a>\n<figcaption class=\"gallery-description\">HTOP on my System76 Lemur Pro (Image Credit: me)</figcaption>\n</figure>\n</div></div>\n<p><strong>Thermals</strong></p>\n<p>On a few occasions, the fans spun up like jet engines, then quickly went silent. During those instances, I was installing multiple package updates from Pop!_Shop or running a video conference in Zoom.</p>\n<p>Otherwise, the machine runs quite cool. I can barely feel any excess heat when it's on my lap during general use. (I'm sure I might have a different experience if I was rendering a 4K video with compositing while sitting on the couch.)</p>\n<h4>RAM</h4>\n<p>Do I really need 40 GB of RAM for a machine that I'm using for hobby projects?</p>\n<p>Generally, no.</p>\n<p>While I do some light video production, photo editing and vector art production, I use my machine mostly for office work, Raspberry Pi and other SBC projects, managing my home lab and testing home automation scripts. </p>\n<p>But I want to <strong>fly</strong> through my workflows. When I'm in The Zone, I don't want to deal with a lagging OS. Having excess memory ensures that the OS almost never has to write anything to the swap partition on the disk. (Also referred to as \"Virtual RAM.\" <a href=\"https://en.wikipedia.org/wiki/Virtual_memory\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Virtual RAM on Wikipedia\">Wikipedia</a>)</p>\n<p>Plus, maxing out the RAM ensures that the machine will have a long service life without much effort, and the additional memory improves its resale value should I decide to upgrade to a new machine in the future.</p>\n<h4>Storage</h4>\n<p>My preferred configuration is to have a small (&lt;250 GB) NVMe drive for the OS and a second, larger NVMe drive for my /home directory and files. However, after lots of shopping around, it doesn't appear that the smaller NVMe drives even come close to the performance of those that are 500 GB or larger, which is an important consideration for the OS drive.</p>\n<p>With that in mind, I selected the smallest, fastest NVMe drive available during system configuration for both the OS and my files - <a href=\"https://amzn.to/2VchDk4\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Samsung EVO Pro\">a 512 GB Samsung EVO Pro</a>. I could have gotten a 1 TB drive with the same read/write specs, but most of my larger media files are stored on NAS on my LAN, and in the cloud. I can upgrade to a larger drive or add a second drive at a later time, if I need it.</p>\n<h4>Networking</h4>\n<p>The Lemur Pro uses the onboard Intel networking controller with the 802.11ac spec and speeds up to 867 Mbps. I have other machines with 802.11ac but this feels much snappier, perhaps because web pages render so quickly. File transfers over SAMBA, SFTP, NFS and HTTPS also seem very fast.</p>\n<h4>Battery Life</h4>\n<p>If you've read this far, you know that I am not a professional PC reviewer so I had to improvise the battery life evaluation.</p>\n<p>Here's what I did:</p>\n<p>I unplugged the machine from the power supply and spent 4 hours writing this post, responding to email, watching YouTube tutorials on how to optimize OpenMediaVault and NextCloud, downloading software, and connecting with friends and family on social media.</p>\n<p>I didn't do any video rendering or stream a ton of HD video, and I didn't compile any code. Basically, I just used it like an average consumer.</p>\n<p>At the end of the 4 hours, my battery was at 91%. Pop!_OS indicated that I still had over 20 hours of use. The Pop!_OS power management profile was set to \"Balanced.\"</p>\n<p>It's not a scientific benchmark, but it should give you some idea about the battery life of the Lemur Pro: it's remarkable.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://gadgetboy.org/media/posts/43/power_after_4_hours.png\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"https://gadgetboy.org/media/posts/43/responsive/power_after_4_hours-xs.png 300w ,https://gadgetboy.org/media/posts/43/responsive/power_after_4_hours-sm.png 480w ,https://gadgetboy.org/media/posts/43/responsive/power_after_4_hours-md.png 768w ,https://gadgetboy.org/media/posts/43/responsive/power_after_4_hours-lg.png 1024w\"  alt=\"Power Indicator after 4 hours\" width=\"327\" height=\"445\">\n<figcaption >Power indicator after 4 hours of use. (Image Credit: me)</figcaption>\n</figure>\n<p>Eventually, I'll get a feel for how the battery life holds up under heavier loads.</p>\n<h2>Final Thoughts</h2>\n<p>I provided my opinion of this laptop based on my specific needs using my own decision making criteria. However, I'm hoping that based on my experience, you can get a sense of how well it might work for you.</p>\n<h3>Positives:</h3>\n<ul>\n<li>Premium specs, look and feel</li>\n<li>Light, Magnesium-Alloy chassis</li>\n<li>Bright, color-accurate, matte-finish 1080p screen </li>\n<li>Solid keyboard with good key travel</li>\n<li>Ample ports</li>\n<li>USB Type-C Power Delivery with Display Port</li>\n<li>Powerful CPU that runs cool during general use</li>\n<li>Quiet fans</li>\n<li>Excellent trackpad performance</li>\n<li>Pop!_OS (of course)</li>\n<li><em>Complete hardware support</em> for Pop!_OS</li>\n<li>An envelope full of cool stickers <span data-offset-key=\"7su1a-0-0\">😉</span></li>\n</ul>\n<h3>Neutrals:</h3>\n<ul>\n<li>Slight chassis flex in certain use cases</li>\n<li>Camera bump on the top screen bezel</li>\n</ul>\n<h3>Negatives:</h3>\n<ul>\n<li>Poorly placed power button</li>\n<li>The power supply cables are waaayyy too short</li>\n</ul>\n<p class=\"msg msg--success\">Overall, I'm extremely satisfied with my purchase of the Lemur Pro and am now wondering why I didn't buy a System76 machine sooner.</p>\n<p>Do you have a Lemur Pro? Do you want one? Do you have specific questions about things I didn't cover?</p>\n<p>Let me know in the comments or on <a href=\"https://twitter.com/gadgetboy\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"@gadgetboy on twitter\">Twitter</a>.</p>\n<p>---</p>\n<h6>Footnotes</h6>\n<p>* If you have the budget and you're looking for a machine pre-installed with Ubuntu, you owe it to yourself to explore a <a href=\"https://www.dell.com/en-us/work/shop/overview/cp/linuxsystems#tab-2\" target=\"_blank\" rel=\"noopener noreferrer\" title=\"Dell XPS 13 Developer Edition\">Dell XPS 13 or 15 Developer Edition</a>. I had the privilege of getting to play with the new XPS 13 at CES this year and it's nothing short of amazing.</p>\n<p> </p>",
            "image": "https://gadgetboy.org/media/posts/43/lemur.jpg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
            ],
            "date_published": "2020-04-17T14:34:22-05:00",
            "date_modified": "2022-02-18T08:26:04-06:00"
        },
        {
            "id": "https://gadgetboy.org/what-i-did-on-my-holiday-staycation-2020-edition/",
            "url": "https://gadgetboy.org/what-i-did-on-my-holiday-staycation-2020-edition/",
            "title": "What I did on my Holiday Staycation, 2020 Edition",
            "summary": "I’m very fortunate. I work for a company that closes down for&hellip;",
            "content_html": "<p>I’m very fortunate. I work for a company that closes down for the holidays, from December 25th to January 2nd.</p>\n<p>For me, this is a period of decompression. Not just because <strong><em>I</em></strong> have the time off from work, but because <strong><em>all of my colleagues</em></strong> do, as well. There’s no pressure to check email every day and, should anything urgent pop-up during that period, people can always text me.</p>\n<p>But mostly, in addition to spending time with family and friends, I take this time to learn new things and to tinker – activities I rarely have time to do throughout the year.</p>\n<p>Here’s this year’s list.</p>\n<ol>\n<li><strong>I <a href=\"https://gadgetboy.org/alarming-news/\" title=\"Alarming News\">installed</a> a <a rel=\"noopener noreferrer\" aria-label=\"Ring Alarm System (opens in a new tab)\" href=\"https://amzn.to/2ZSQjYJ\" target=\"_blank\">Ring Alarm System</a> </strong>that included the <a rel=\"noopener noreferrer\" aria-label=\"Ring Alarm Retrofit Kit (opens in a new tab)\" href=\"https://amzn.to/35oIjjw\" target=\"_blank\">Ring Alarm Retrofit Kit</a> and the existing home security wiring. I learned a lot about home security wiring and, more importantly, how the home security market is being disrupted by the Internet of Things (IoT).</li>\n<li>I kicked my <a rel=\"noopener noreferrer\" aria-label=\"Vera Edge (opens in a new tab)\" href=\"https://amzn.to/2Qo1c1F\" target=\"_blank\">Vera Edge</a> home controller to the curb and <strong>built a new home automation system from scratch</strong> using the open source <a rel=\"noopener noreferrer\" aria-label=\"Home Assistant (opens in a new tab)\" href=\"https://www.home-assistant.io\" target=\"_blank\">Home Assistant</a> software, a <a rel=\"noopener noreferrer\" aria-label=\"Raspberry Pi 4 (opens in a new tab)\" href=\"https://amzn.to/2QL4riJ\" target=\"_blank\">Raspberry Pi 4</a> and a <a rel=\"noopener noreferrer\" aria-label=\"GoControl HUSBZB-1 (opens in a new tab)\" href=\"https://amzn.to/2SUbeJv\" target=\"_blank\">GoControl HUSBZB-1</a>. (Full post to come.)</li>\n<li><strong>I started learning <a rel=\"noopener noreferrer\" aria-label=\"YAML (opens in a new tab)\" href=\"https://yaml.org/\" target=\"_blank\">YAML</a>.</strong> Even though you don’t have to break out a programmers text editor to use Home Assistant, if you want to create more complex automations or get very specific in how you configure the user interface, you have to use YAML. This also helped me in my next endeavor.</li>\n<li><strong>I learned how to manage <a rel=\"noopener noreferrer\" aria-label=\"Ruby (opens in a new tab)\" href=\"https://www.ruby-lang.org\" target=\"_blank\">Ruby</a> packages</strong> so that I could <strong>install and configure <a rel=\"noopener noreferrer\" aria-label=\"Jekyll (opens in a new tab)\" href=\"https://jekyllrb.com/\" target=\"_blank\">Jekyll</a> </strong>to publish this blog. (Full post to come) Jekyll helps you build static sites so they are <em>really</em> fast and, most importantly, <strong>unhackable</strong>. I’ve had way too many WordPress instances get hacked and fixing them was a major PITA. Jekyll is also configured using YAML. <br><br>Do I really need to do this? I mean, a basic blog on WordPress.com is cheap, fast and reliable. <br><br>Of course not. I just want to learn something new. <br><br>Once I figure out how to customize Jekyll themes and import posts from WordPress, I’ll probably host the files on <a rel=\"noopener noreferrer\" aria-label=\"GitHub Pages (opens in a new tab)\" href=\"https://pages.github.com/\" target=\"_blank\">GitHub Pages</a>. I’ve been considering running the static site from a <a rel=\"noopener noreferrer\" aria-label=\"Raspberry Pi 2 B (opens in a new tab)\" href=\"https://amzn.to/2ZSV9Fn\" target=\"_blank\">Raspberry Pi 2 B</a> on my home network, but this might be more trouble than it’s worth. I ran out of time during this holiday break, so getting this working will take a little longer.</li>\n</ol>\n<p>What did you learn this year?</p>",
            "image": "https://gadgetboy.org/media/posts/3/staycation_postcard.jpeg",
            "author": {
                "name": "John A. Federico"
            },
            "tags": [
                   "YAML",
                   "Internet of Things",
                   "Home Automation",
                   "Home Assistant",
                   "Coding"
            ],
            "date_published": "2020-01-05T09:04:00-06:00",
            "date_modified": "2020-03-13T12:50:11-05:00"
        }
    ]
}
